<legalnotice id="legalnotice">
	<para>
	  Das vorliegende Dokument kann gem&auml;&szlig; den Bedingungen der GNU Free Documentation License (GFDL), Version 1.1 oder jeder sp&auml;teren, von der Free Software Foundation ver&ouml;ffentlichten Version ohne unver&auml;nderbare Abschnitte sowie ohne Texte auf dem vorderen und hinteren Buchdeckel kopiert, verteilt und/oder modifiziert werden. Eine Kopie der GFDL finden Sie unter diesem <ulink type="help" url="ghelp:fdl">Link</ulink> oder in der mit diesem Handbuch gelieferten Datei COPYING-DOCs.
         </para>
         <para> Das vorliegende Handbuch ist Teil einer Reihe von GNOME-Handb&uuml;chern, die unter der GFDL verteilt werden. Wenn Sie dieses Handbuch separat verteilen m&ouml;chten, k&ouml;nnen Sie dies tun, indem Sie dem Handbuch eine Kopie der Lizenz, wie in Abschnitt 6 der Lizenz beschrieben, hinzuf&uuml;gen.
	</para>

	<para>
	  Bei vielen der von Firmen zur Unterscheidung ihrer Produkte und Dienstleistungen verwendeten Namen handelt es sich um Marken. An den Stellen, an denen derartige Namen in einer GNOME-Dokumentation vorkommen und wenn die Mitglieder des GNOME Documentation Project &uuml;ber diese Marken informiert wurden, sind die Namen in Grossbuchstaben oder mit gro&szlig;en Anfangsbuchstaben geschrieben.</para>

	<para>
	  DAS DOKUMENT UND MODIFIZIERTE VERSIONEN DES DOKUMENTS WERDEN GEM&Auml;SS DER BEDINGUNGEN DER GNU FREE DOCUMENTATION LICENSE MIT DER FOLGENDEN VEREINBARUNG BEREITGESTELLT:

	  <orderedlist>
		<listitem>
		  <para>DAS DOKUMENT WIRD "WIE VORLIEGEND" GELIEFERT, OHNE JEGLICHE GEW&Auml;HRLEISTUNG, WEDER AUSDR&Uuml;CKLICH NOCH STILLSCHWEIGEND, EINSCHLIESSLICH, ABER NICHT BESCHR&Auml;NKT AUF, GEW&Auml;HRLEISTUNGEN, DASS DAS DOKUMENT ODER EINE MODIFIZIERTE VERSION DES DOKUMENTS FREI VON HANDELS&Uuml;BLICHEN FEHLERN UND F&Uuml;R EINEN BESTIMMTEN ZWECK GEEIGNET IST UND KEINE RECHTE DRITTER VERLETZT. JEGLICHES RISIKO IN BEZUG AUF DIE QUALIT&Auml;T, GENAUIGKEIT UND LEISTUNG DES DOKUMENTS ODER EINER MODIFIZIERTEN VERSION DES DOKUMENTS TRAGEN SIE. SOLLTE SICH EIN DOKUMENT ODER EINE MODIFIZIERTE VERSION DAVON IN IRGENDEINER WEISE ALS FEHLERHAFT ERWEISEN, TRAGEN SIE (NICHT DER URSPR&Uuml;NGLICHE VERFASSER, AUTOR ODER EIN MITWIRKENDER) DIE KOSTEN F&Uuml;R JEGLICHE ERFORDERLICHE SERVICE-, REPARATUR- UND KORREKTURMASSNAHMEN: DIESE BESCHR&Auml;NKUNG DER GEW&Auml;HRLEISTUNG IST WESENTLICHER BESTANDTEIL DIESER LIZENZ. JEDE VERWENDUNG EINES DOKUMENTS ODER EINER MODIFIZIERTEN VERSION DES DOKUMENTS UNTERLIEGT DIESER BESCHR&Auml;NKUNG; UND UNTER KEINEN UMST&Auml;NDEN UND GEM&Auml;SS KEINER RECHTSLEHRE, WEDER AUFGRUND VON UNERLAUBTEN HANDLUNGEN (EINSCHLIESSLICH FAHRL&Auml;SSIGKEIT), VERTR&Auml;GEN ODER SONSTIGEM, KANN DER AUTOR, DER URSPR&Uuml;NGLICHE VERFASSER, EIN MITWIRKENDER ODER EIN VERTEILER DES DOKUMENTS ODER EINER MODIFIZIERTEN VERSION DES DOKUMENTS ODER EIN LIEFERANT EINER DIESER PARTEIEN VON EINER PERSON F&Uuml;R DIREKTE, INDIREKTE, BESONDERE, ZUF&Auml;LLIGE ODER ALS FOLGE AUFGETRETENE SCH&Auml;DEN IRGENDEINER ART, EINSCHLIESSLICH, ABER NICHT BESCHR&Auml;NKT AUF, SCH&Auml;DEN DURCH GESCH&Auml;FTSWERTVERLUSTE, ARBEITSAUSF&Auml;LLE, COMPUTERAUSF&Auml;LLE ODER -FUNKTIONSST&Ouml;RUNGEN ODER JEGLICHE ANDERE SCH&Auml;DEN ODER VERLUSTE, DIE DURCH ODER IM ZUSAMMENHANG MIT DER VERWENDUNG DES DOKUMENTS ODER EINER MODIFIZIERTEN VERSION DES DOKUMENTS ENTSTANDEN SIND, SELBST WENN DIESE PARTEI &Uuml;BER M&Ouml;GLICHE SCH&Auml;DEN INFORMIERT WORDEN SEIN SOLLTE, HAFTBAR GEMACHT WERDEN.
		  </para>
		</listitem>
	  </orderedlist>
	</para>
  </legalnotice>

