Repository: GNOME/gnome-calculator
Catalog: help/*/*.po
Languages: cs

source: By default, trailing zeroes are not shown. To display trailing zeroes, click <guibutton>Acc</guibutton> then select <guilabel>Show Trailing Zeroes</guilabel> from the popup menu, or choose <menuchoice><guimenu>View</guimenu><guimenuitem>Show Trailing Zeroes</guimenuitem></menuchoice>. A preceding check mark in the <guibutton>Acc</guibutton> popup menu or <guimenu>View</guimenu> menu indicates that the <guilabel>Show Trailing Zeroes</guilabel> option has been selected. To hide trailing zeroes, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Show Trailing Zeroes</guimenuitem></menuchoice> again.
cs: Standardně se nezobrazují nevýznamné koncové nuly. Pokud je zobrazovat chcete, tak klikněte na <guibutton>Acc</guibutton> a zvolte ve vyskakovací nabídce <guilabel>Zobrazovat koncové nuly</guilabel> nebo přes hlavní nabídku zvolte <menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Zobrazovat koncové nuly</guimenuitem></menuchoice>. Zaškrtnutí ve vyskakovací nabídce <guibutton>Acc</guibutton>, případně v hlavní nabídce <guimenu>Zobrazit</guimenu>, signalizuje, jestli je volba <guilabel>Zobrazovat koncové nuly</guilabel> zapnutá. Opětovnou volbou v nabídce koncové nuly skryjete.

source: The examples in the following table show how the accuracy setting affects <replaceable>x</replaceable> in the display area, when you use decimal base, with the <guimenuitem>Show Trailing Zeroes</guimenuitem> option selected, for the <literal>1 / 8 = <replaceable>x</replaceable></literal> calculation:
cs: Následující příklady demonstrují, jak se nastavení přesnosti projeví na zobrazení <replaceable>x</replaceable> na displeji při výpočtu <literal>1 / 8 = <replaceable>x</replaceable></literal> v případě, že použijete desítkovou soustavu a máte zapnutou volbu <guimenuitem>Zobrazovat koncové nuly</guimenuitem>:

source: Accuracy
cs: Přesnost

source: 1 significant place
cs: 1 významné místo

source: 2 significant places
cs: 2 významná místa

source: 3 significant places
cs: 3 významná místa

source: To Set the Display Type
cs: Nastavení typu displeje

source: To set the display type, select one of the buttons described in <xref linkend="gcalctool-TBL-display-type"/>.
cs: K nastavení typu displeje použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-display-type"/>.

source: Setting the Display Type
cs: Nastavení typu displeje

source: Engineering Display Type
cs: Inženýrský typ displeje

source: Sets the display type to engineering format. Results are displayed in scientific notation. The exponent is always a multiple of three.
cs: Nastaví displej na inženýrský formát. Výsledky se zobrazují ve vědeckém zápisu. Exponent je vždy násobkem tři.

source: Fixed-Point Display Type
cs: Typ displeje s pevnou čárkou

source: Sets the display type to fixed-point format. Results are not displayed in scientific notation. Fixed-point is the default display type. If you change from scientific mode to either basic mode or financial mode, <application>gcalctool</application> automatically sets the display type to fixed-point format.
cs: Nastaví typ displeje na formát s pevnou čárkou. Výsledky se nezobrazují ve vědeckém zápisu. Jedná se o výchozí typ displeje. Pokud se přepnete z vědeckého režimu do základního nebo finančního, tak <application>gcalctool</application> automaticky přepne typ displeje na formát s pevnou čárkou.

source: Scientific Display Type
cs: Vědecký typ displeje

source: Sets the display type to scientific format. Results are displayed in scientific notation, with a fixed number of numeric digits.
cs: Nastaví typ displeje na vědecký formát. Výsledky se zobrazují ve vědeckém zápisu s pevným počtem číslic.

source: To Set the Trigonometric Type
cs: Nastavení trigonometrických jednotek

source: To set the trigonometric type, select one of the buttons described in <xref linkend="gcalctool-TBL-trig-type"/>.
cs: K nastavení trigonometrických jednotek použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-trig-type"/>.

source: Setting the Trigonometric Type
cs: Nastavení trigonometrických jednotek

source: Degrees
cs: Stupně

source: Sets the trigonometric type to degrees. Degrees is the default trigonometric type.
cs: Nastaví trigonometrické jednotky na stupně. Stupně jsou výchozí trigonometrickou jednotkou.

source: Gradians
cs: Grady

source: Sets the trigonometric type to gradians.
cs: Nastaví trigonometrické jednotky na grady.

source: Radians
cs: Radiány

source: Sets the trigonometric type to radians.
cs: Nastaví trigonometrické jednotky na radiány.

source: To Set the Trigonometric Options
cs: Nastavení přepínačů pro trigonometrické funkce

source: To set the trigonometric options, use the options described in <xref linkend="gcalctool-TBL-trig-options"/>.
cs: Pro trigonometrické funkce můžete použít přepínače, které popisuje <xref linkend="gcalctool-TBL-trig-options"/>.

source: Setting the Trigonometric Options
cs: Nastavení přepínačů pro trigonometrické funkce

source: Hyperbolic Option Indicator
cs: Hyperbolická funkce

source: Selects the hyperbolic option for use with the trigonometric functions.
cs: Zvolí hyperbolickou verzi pro použitou trigonometrickou funkci

source: Inverse Option Indicator
cs: Inverzní funkce

source: Selects the inverse option for use with the trigonometric functions.
cs: Zvolí inverzní funkci pro použitou trigonometrickou funkci.

source: By default, the options described in <xref linkend="gcalctool-TBL-trig-options"/> are not selected. Click <guibutton>Clr</guibutton> to deselect these options.
cs: Ve výchozím stavu nejsou přepínače, jak je popisuje <xref linkend="gcalctool-TBL-trig-options"/>, zapnuté. Vypnout se také po kliknutí na <guibutton>Clr</guibutton>.

source: To Calculate Trigonometric Values
cs: Výpočet trigonometrických hodnot

source: To calculate trigonometric values, use the buttons described in <xref linkend="gcalctool-TBL-trig-calc"/>.
cs: K výpočtům trigonometrických hodnot použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-trig-calc"/>.

source: Calculating Trigonometric Values
cs: Výpočet trigonometrických hodnot

source: Cosine <literal>cos</literal>
cs: Kosinus <literal>cos</literal>

source: <guibutton>Cos</guibutton>, <guilabel>Hyp</guilabel> option not selected, <guilabel>Inv</guilabel> option not selected
cs: <guibutton>Cos</guibutton>, <guilabel>Hyp</guilabel> není zapnuté, <guilabel>Inv</guilabel> není zapnuté

source: Calculates the cosine of the current value in the display area.
cs: Vypočítá kosinus aktuální hodnoty na displeji.

source: Arc Cosine <literal>acos</literal>
cs: Arkus kosinus <literal>acos</literal>

source: <guibutton>Cos</guibutton>, <guilabel>Hyp</guilabel> option not selected, <guilabel>Inv</guilabel> option selected
cs: <guibutton>Cos</guibutton>, <guilabel>Hyp</guilabel> není zapnuté, <guilabel>Inv</guilabel> je zapnuté

source: Calculates the arc cosine of the current value in the display area.
cs: Vypočítá arkus kosinus aktuální hodnoty na displeji.

source: Hyperbolic Cosine <literal>cosh</literal>
cs: Hyperbolický kosinus <literal>cosh</literal>

source: <guibutton>Cos</guibutton>, <guilabel>Hyp</guilabel> option selected, <guilabel>Inv</guilabel> option not selected
cs: <guibutton>Cos</guibutton>, <guilabel>Hyp</guilabel> je zapnuté, <guilabel>Inv</guilabel> není zapnuté

source: Calculates the hyperbolic cosine of the current value in the display area.
cs: Vypočítá hyperbolický kosinus aktuální hodnoty na displeji.

source: Arc Hyperbolic Cosine <literal>acosh</literal>
cs: Arkus hyperbolický kosinus <literal>acosh</literal>

source: <guibutton>Cos</guibutton>, <guilabel>Hyp</guilabel> option selected, <guilabel>Inv</guilabel> option selected
cs: <guibutton>Cos</guibutton>, <guilabel>Hyp</guilabel> je zapnuté, <guilabel>Inv</guilabel> je zapnuté

source: Calculates the arc hyperbolic cosine of the current value in the display area.
cs: Vypočítá arkus hyperbolický kosinus aktuální hodnoty na displeji.

source: Sine <literal>sin</literal>
cs: Sinus <literal>sin</literal>

source: <guibutton>Sin</guibutton>, <guilabel>Hyp</guilabel> option not selected, <guilabel>Inv</guilabel> option not selected
cs: <guibutton>Sin</guibutton>, <guilabel>Hyp</guilabel> není zapnuté, <guilabel>Inv</guilabel> není zapnuté

source: Calculates the sine of the current value in the display area.
cs: Vypočítá sinus aktuální hodnoty na displeji.

source: Arc Sine <literal>asin</literal>
cs: Arkus sinus <literal>asin</literal>

source: <guibutton>Sin</guibutton>, <guilabel>Hyp</guilabel> option not selected, <guilabel>Inv</guilabel> option selected
cs: <guibutton>Sin</guibutton>, <guilabel>Hyp</guilabel> není zapnuté, <guilabel>Inv</guilabel> je zapnuté

source: Calculates the arc sine of the current value in the display area.
cs: Vypočítá arkus sinus aktuální hodnoty na displeji.

source: Hyperbolic Sine <literal>sinh</literal>
cs: Hyperbolický sinus <literal>sinh</literal>

source: <guibutton>Sin</guibutton>, <guilabel>Hyp</guilabel> option selected, <guilabel>Inv</guilabel> option not selected
cs: <guibutton>Sin</guibutton>, <guilabel>Hyp</guilabel> je zapnuté, <guilabel>Inv</guilabel> není zapnuté

source: Calculates the hyperbolic sine of the current value in the display area.
cs: Vypočítá hyperbolický sinus aktuální hodnoty na displeji.

source: Arc Hyperbolic Sine <literal>asinh</literal>
cs: Arkus hyperbolický sinus <literal>asinh</literal>

source: <guibutton>Sin</guibutton>, <guilabel>Hyp</guilabel> option selected, <guilabel>Inv</guilabel> option selected
cs: <guibutton>Sin</guibutton>, <guilabel>Hyp</guilabel> je zapnuté, <guilabel>Inv</guilabel> je zapnuté

source: Calculates the arc hyperbolic sine of the current value in the display area.
cs: Vypočítá arkus hyperbolický sinus aktuální hodnoty na displeji.

source: Tangent <literal>tan</literal>
cs: Tangens <literal>tan</literal>

source: <guibutton>Tan</guibutton>, <guilabel>Hyp</guilabel> option not selected, <guilabel>Inv</guilabel> option not selected
cs: <guibutton>Tan</guibutton>, <guilabel>Hyp</guilabel> není zapnuté, <guilabel>Inv</guilabel> není zapnuté

source: Calculates the tangent of the current value in the display area.
cs: Vypočítá tangens aktuální hodnoty na displeji.

source: Arc Tangent <literal>atan</literal>
cs: Arkus tangens <literal>atan</literal>

source: <guibutton>Tan</guibutton>, <guilabel>Hyp</guilabel> option not selected, <guilabel>Inv</guilabel> option selected
cs: <guibutton>Tan</guibutton>, <guilabel>Hyp</guilabel> není zapnuté, <guilabel>Inv</guilabel> je zapnuté

source: Calculates the arc tangent of the current value in the display area.
cs: Vypočítá arkus tangens aktuální hodnoty na displeji.

source: Hyperbolic Tangent <literal>tanh</literal>
cs: Hyperbolický tangens <literal>tanh</literal>

source: <guibutton>Tan</guibutton>, <guilabel>Hyp</guilabel> option selected, <guilabel>Inv</guilabel> option not selected
cs: <guibutton>Tan</guibutton>, <guilabel>Hyp</guilabel> je zapnuté, <guilabel>Inv</guilabel> není zapnuté

source: Calculates the hyperbolic tangent of the current value in the display area.
cs: Vypočítá hyperbolický tangens aktuální hodnoty na displeji.

source: Arc Hyperbolic Tangent <literal>atanh</literal>
cs: Arkus hyperbolický tangens <literal>atanh</literal>

source: <guibutton>Tan</guibutton>, <guilabel>Hyp</guilabel> option selected, <guilabel>Inv</guilabel> option selected
cs: <guibutton>Tan</guibutton>, <guilabel>Hyp</guilabel> je zapnuté, <guilabel>Inv</guilabel> je zapnuté

source: Calculates the arc hyperbolic tangent of the current value in the display area.
cs: Vypočítá arkus hyperbolický tangens aktuální hodnoty na displeji.

source: To Calculate Logarithms
cs: Výpočet logaritmů

source: To calculate logarithms, use the buttons described in <xref linkend="gcalctool-TBL-logs-calc"/>.
cs: K výpočtu logaritmů použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-logs-calc"/>.

source: Calculating Logarithms
cs: Výpočet logaritmů

source: Common Logarithm Base 10
cs: Desítkový logaritmus

source: Calculates the common logarithm (base 10) of the current value in the display area.
cs: Vypočítá běžný logaritmus o základu 10 z aktuální hodnoty na displeji

source: Natural Logarithm
cs: Přirozený logaritmus

source: Calculates the natural logarithm of the current value in the display area.
cs: Vypočítá přirozený logaritmus z aktuální hodnoty na displeji

source: Common Logarithm Base 2
cs: Dvojkový logaritmus

source: Calculates the common logarithm (base 2) of the current value in the display area.
cs: Vypočítá běžný logaritmus o základu 2 z aktuální hodnoty na displeji

source: Common antilogarithm and natural antilogarithm are not supported in this version of <application>gcalctool</application>.
cs: V této verzi <application>gcalctool</application> není podporovaný běžný antilogaritmus a přirozený antilogaritmus.

source: To Enter Exponential Numbers
cs: Zadávání čísel v exponenciálním tvaru

source: To enter exponential numbers, use the <guibutton>Exp</guibutton> button.
cs: K zadání čísel v exponenciálním tvaru použijte tlačítko <guibutton>Exp</guibutton>.

source: The <guibutton>Exp</guibutton> button enables you to enter numbers in scientific notation, that is, <replaceable>mantissa</replaceable> * <replaceable>base</replaceable><superscript><replaceable>exponent</replaceable></superscript>:
cs: Tlačítko <guibutton>Exp</guibutton> vám umožňuje zadávat čísla ve vědeckém zápisu, což je <replaceable>mantissa</replaceable> × <replaceable>base</replaceable><superscript><replaceable>exponent</replaceable></superscript>:

source: mantissa
cs: mantisa

source: Current non-zero value in the display area. If the current value in the display area is zero, the mantissa is 1.0.
cs: Aktuální nenulové číslo na displeji. Pokud je aktuální hodnota na displeji nula, tak se použije mantisa 1,0.

source: base
cs: základ

source: 2, 8, 10, or 16 for binary, octal, decimal, and hexadecimal numeric base respectively.
cs: 2, 8, 10 nebo 16 pro dvojkovou, osmičkovou, desítkovou a šestnáctkovou číselnou soustavu.

source: Next number that you enter.
cs: Další číslo, které zadáte.

source: When you click <guibutton>Exp</guibutton>, the calculator displays <literal>. +</literal> to represent <replaceable>base</replaceable> to the power of the next number that you enter.
cs: Po kliknutí na <guibutton>Exp</guibutton> kalkulačka zobrazí <literal>. +</literal> představující <replaceable>základ</replaceable> mocniny, které následně zadáte hodnotu.

source: To change the sign of the number, use the <guibutton>+/-</guibutton> button before the <guibutton>Exp</guibutton> button. How you change the sign of the exponent (the power to which the number is raised) depends on whether you are in arithmetic precedence mode or not. In arithmetic precedence mode, use <guibutton>-</guibutton> after the <guibutton>Exp</guibutton> button, otherwise use the <guibutton>+/-</guibutton> button after entering the exponent.
cs: Pro změnu znaménka číslo použijte tlačítko <guibutton>+/-</guibutton> ještě před zmáčknutím tlačítka <guibutton>Exp</guibutton>. Postup změny znaménka exponentu (hodnota na kterou je číslo umocněno) závisí na tom, zda je zapnutí priorita operací nebo ne. V režimu priority operací použijte <guibutton>-</guibutton> po tlačítku <guibutton>Exp</guibutton>, jinak použijte tlačítko <guibutton>+/-</guibutton> až po zadání exponentu.

source: To enter a decimal number in exponential format, in arithmetic precedence mode, use the guidelines in the following table:
cs: Při zadávání desítkových čísel v exponenciálním formátu při zapnuté prioritě operací postupujte podle ukázek v následující tabulce:

source: Number
cs: Číslo

source: Enter
cs: Zadání

source: Number Displayed
cs: Zobrazené číslo

source: To enter a decimal number in exponential format, in non-arithmetic precedence mode, use the guidelines in the following table:
cs: Při zadávání desítkových čísel v exponenciálním formátu při vypnuté prioritě operací postupujte podle ukázek v následující tabulce:

source: To Use Constant Values
cs: Používání konstantních hodnot

source: Click <guibutton>Con</guibutton> to display the list of defined constant values. All constant values are specified in decimal numeric base, even if the current numeric base is not decimal.
cs: Kliknutím na <guibutton>Con</guibutton> zobrazíte seznam definovaných konstantních hodnot. Všechny konstanty jsou definované v desítkové soustavě, i když máte v daný okamžik nastavenou jinou číselnou soustavu.

source: Select a constant from the menu to enter its value in the display area. If you use the keyboard shortcut <keycap>#</keycap>, you can use the keyboard to specify the constant, as shown in the following example:
cs: Zvolením konstanty v nabídce přenesete její hodnotu na displej. Pokud použijete klávesovou zkratku <keycap>#</keycap>, můžete z klávesnice zvolit i kterou konstantu chcete, tak jak je uvedeno v následujícím příkladu:

source: Constant
cs: Konstanta

source: The <application>gcalctool</application> application provides ten default constant values, as described in the following table:
cs: Aplikace <application>gcalctool</application> vám dává k dispozici výchozí konstantní hodnoty, které jsou popsané v následující tabulce:

source: Value
cs: Hodnota

source: Kilometer-to-mile conversion factor
cs: Převodní činitel kilometrů na míle

source: Multiply the current value in the display area by this constant, to convert from kilometers per hour to miles per hour. For example, 8 * <guibutton>Con</guibutton><guilabel>C0</guilabel><keycap>=</keycap> 5.
cs: Pokud chcete převést kilometry v hodině na míle v hodině, tak vynásobte aktuální hodnotu na displeji touto konstantou. Například 8 × <guibutton>Con</guibutton><guilabel>C0</guilabel><keycap>=</keycap> 5.

source: Divide the current value in the display area by this constant, to convert from miles per hour to kilometers per hour. For example, 5 / <guibutton>Con</guibutton><guilabel>C0</guilabel><keycap>=</keycap> 8.
cs: Pokud chcete převést míle v hodině na kilometry v hodině, tak podělte aktuální hodnotu na displeji touto konstantou. Například 5 ÷ <guibutton>Con</guibutton><guilabel>C0</guilabel><keycap>=</keycap> 8.

source: Square root of 2
cs: Druhá odmocnina z 2

source: pi
cs: π (Ludolfovo číslo)

source: Centimeter-to-inch conversion factor
cs: Převodní činitel centimetrů na palce

source: Multiply the current value in the display area by this constant, to convert from centimeters to inches. For example, 30 * <guibutton>Con</guibutton><guilabel>C4</guilabel><keycap>=</keycap> 12.
cs: Pokud chcete převést centimetry na palce, tak vynásobte aktuální hodnotu na displeji touto konstantou. Například 30 × <guibutton>Con</guibutton><guilabel>C4</guilabel><keycap>=</keycap> 12.

source: Divide the current value in the display area by this constant, to convert from inches to centimeters. For example, 12 / <guibutton>Con</guibutton><guilabel>C4</guilabel><keycap>=</keycap> 30.
cs: Pokud chcete převést palce na centimetry, tak vydělte aktuální hodnotu na displeji touto konstantou. Například 12 ÷ <guibutton>Con</guibutton><guilabel>C4</guilabel><keycap>=</keycap> 30.

source: Degrees in a radian
cs: Stupně v radiánech

source: Gram-to-ounce conversion factor
cs: Převodní činitel gramů na unce

source: Multiply the current value in the display area by this constant, to convert from grams to ounces. For example, 500 * <guibutton>Con</guibutton><guilabel>C7</guilabel><keycap>=</keycap> 18.
cs: Pokud chcete převést gramy na unce, tak vynásobte aktuální hodnotu na displeji touto konstantou. Například 500 × <guibutton>Con</guibutton><guilabel>C7</guilabel><keycap>=</keycap> 18.

source: Divide the current value in the display area by this constant, to convert from ounces to grams. For example, 18 / <guibutton>Con</guibutton><guilabel>C7</guilabel><keycap>=</keycap> 500.
cs: Pokud chcete převést unce na gramy, tak vydělte aktuální hodnotu na displeji touto konstantou. Například 18 ÷ <guibutton>Con</guibutton><guilabel>C7</guilabel><keycap>=</keycap> 500.

source: Kilojoule-to-British-thermal-unit conversion factor
cs: Převodní činitel kilojoulů na britské tepelné jednotky

source: Multiply the current value in the display area by this constant, to convert from kilojoules to British thermal units. For example, 10 * <guibutton>Con</guibutton><guilabel>C8</guilabel><keycap>=</keycap> 9.48.
cs: Pokud chcete převést kilojouly na britské tepelné jednotky, tak vynásobte aktuální hodnotu na displeji touto konstantou. Například 10 × <guibutton>Con</guibutton><guilabel>C8</guilabel><keycap>=</keycap> 9,48.

source: Divide the current value in the display area by this constant, to convert from British thermal units to kilojoules. For example, 9.48 / <guibutton>Con</guibutton><guilabel>C8</guilabel><keycap>=</keycap> 10.
cs: Pokud chcete převést britské tepelné jednotky na kilojouly, tak vydělte aktuální hodnotu na displeji touto konstantou. Například 9,48 ÷ <guibutton>Con</guibutton><guilabel>C8</guilabel><keycap>=</keycap> 10.

source: Cubic-centimeter-to-cubic-inch conversion factor
cs: Převodní činitel krychlových centimetrů na krychlové palce

source: Multiply the current value in the display area by this constant, to convert from cubic centimeters to cubic inches. For example, 100 * <guibutton>Con</guibutton><guilabel>C9</guilabel><keycap>=</keycap> 6.10.
cs: Pokud chcete převést krychlové centimetry na krychlové palce, tak vynásobte aktuální hodnotu na displeji touto konstantou. Například 100 × <guibutton>Con</guibutton><guilabel>C9</guilabel><keycap>=</keycap> 6,10.

source: Divide the current value in the display area by this constant, to convert from cubic inches to cubic centimeters. For example, 6.10 / <guibutton>Con</guibutton><guilabel>C9</guilabel><keycap>=</keycap> 100.
cs: Pokud chcete převést krychlové palce na krychlové centimetry, tak vydělte aktuální hodnotu na displeji touto konstantou. Například 6,10 ÷ <guibutton>Con</guibutton><guilabel>C9</guilabel><keycap>=</keycap> 100.

source: You can overwrite the default constants to store your own constants.
cs: Výchozí konstanty můžete přepsat a tak si uložit vlastní konstanty.

source: To store a new constant or edit an existing constant, perform the following steps:
cs: Když chcete uložit novou konstantu nebo upravit stávající, postupujte podle následujících kroků:

source: Click <guibutton>Con</guibutton>, then select <guilabel>Edit Constants</guilabel> from the popup menu.
cs: Klikněte na <guibutton>Con</guibutton> a ve vyskakovací nabídce zvolte <guilabel>Upravit konstanty...</guilabel>.

source: In the <guilabel>Edit Constants</guilabel> dialog, select the constant that you want to overwrite or edit.
cs: V dialogu <guilabel>Úprava konstant</guilabel> zvolte konstantu, kterou chcete přepsat nebo upravit.

source: Click on the Value field, then enter the new value.
cs: Klikněte na pole Hodnota a zadejte novou hodnotu.

source: Click on the Description field, then enter the new description.
cs: Klikněte na pole Popis a zadejte nový popis.

source: Click <guibutton>OK</guibutton> to save your changes and close the <guilabel>Edit Constants</guilabel> dialog.
cs: Kliknutím na <guibutton>OK</guibutton> se změny uloží a dialog <guilabel>Úprava konstant</guilabel> se zavře.

source: To Use Functions
cs: Používání funkcí

source: To show the available functions, click <guibutton>Fun</guibutton>. A popup menu displays the list of defined functions. Select a function from the menu to run that function. If the function is not defined, the value zero is returned.
cs: Dostupné funkce zobrazíte kliknutím na <guibutton>Fun</guibutton>. Vyskakovací nabídka zobrazí seznam definovaných funkcí. Zvolením funkce v nabídce ji spustíte. Pokud není funkce definovaná, tak bude vrácena hodnota 0.
