Repository: GNOME/gnome-calculator
Catalog: help/*/*.po
Languages: cs

source: If you use the keyboard shortcut <keycap>F</keycap>, you can use the keyboard to specify the function, as shown in the following example:
cs: Pokud použijete klávesovou zkratku <keycap>F</keycap>, můžete z klávesnice i určit, kterou funkci chcete zvolit podle následujícího příkladu:

source: The <application>gcalctool</application> application does not provide any default functions. You can store up to ten functions.
cs: Aplikace <application>gcalctool</application> nemá definované žádné výchozí funkce. Uložit si můžete až deset funkcí.

source: To store a new function or edit an existing function, perform the following steps:
cs: Při ukládání nové funkce nebo upravě stávající postupujte podle následujících kroků:

source: Click <guibutton>Fun</guibutton>, then select <guilabel>Edit Functions</guilabel> from the popup menu.
cs: Klikněte na <guibutton>Fun</guibutton> a ve vyskakovací nabídce zvolte <guilabel>Upravit funkce...</guilabel>

source: In the <guilabel>Edit Functions</guilabel> dialog, select a blank entry, or the function that you want to overwrite.
cs: V dialogu <guilabel>Úprava funkcí</guilabel> zvolte prázdné pole nebo funkci, kterou chcete přepsat.

source: Click on the Value field, then enter the new value. Use the keyboard shortcuts to invoke a <application>gcalctool</application> button. For example, enter <literal>90K</literal> to calculate sine(90).
cs: Klepněte na pole Hodnota a zadejte novou hodnotu. Pro přístup k tlačítkům <application>gcalctool</application> používejte klávesové zkratky. Například zadáním <literal>90k</literal> vypočítáte sin(90).

source: Click on the Description field, then enter the new description. For example, <literal>Sine 90</literal>.
cs: Klepněte na pole Popis a zadejte nový popis. Například <literal>Sin 90</literal>.

source: Click <guibutton>OK</guibutton> to save your changes and close the <guilabel>Edit Functions</guilabel> dialog.
cs: Kliknutím na <guibutton>OK</guibutton> změny uložíte a zavřete dialog <guilabel>Úprava funkcí</guilabel>.

source: To Perform Miscellaneous Scientific Calculations
cs: Provádění rozmanitých vědeckých výpočtů

source: To perform miscellaneous scientific calculations, use the buttons described in <xref linkend="gcalctool-TBL-misc-calc"/>.
cs: K provádění dalších vědeckých výpočtů použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-misc-calc"/>.

source: Performing Miscellaneous Scientific Calculations
cs: Provádění různorodých vědeckých výpočtů.

source: e to the <replaceable>x</replaceable> power
cs: e na <replaceable>x</replaceable>-tou

source: Calculates the value of <literal>e</literal> raised to the power of the current value in the display area.
cs: Vypočítá hodnotu <literal>e</literal> umocněného na aktuální hodnotu na displeji.

source: 10 to the <replaceable>x</replaceable> power
cs: 10 na <replaceable>x</replaceable>-tou

source: Calculates the value of 10 raised to the power of the current value in the display area.
cs: Vypočítá hodnotu čísla 10 umocněného na aktuální hodnotu na displeji.

source: 2 to the <replaceable>x</replaceable> power
cs: 2 na <replaceable>x</replaceable>-tou

source: Calculates the value of 2 raised to the power of the current value in the display area.
cs: Vypočítá hodnotu čísla 2 umocněného na aktuální hodnotu na displeji.

source: x to the <replaceable>y</replaceable> power
cs: x na <replaceable>y</replaceable>-tou

source: Raises the current value in the display area to the power of the next value that you enter.
cs: Umocní aktuální hodnotu na displeji na hodnotu, kterou zadáte následně.

source: x to the reciprocal <replaceable>y</replaceable> power
cs: x umocněné na převrácenou hodnotu <replaceable>y</replaceable>

source: Raises the current value in the display area to the reciprocal power of the next value that you enter.
cs: Umocní aktuální hodnotu na displeji převrácenou hodnotou čísla, které následně zadáte.

source: <replaceable>x</replaceable> Factorial
cs: <replaceable>x</replaceable> faktoriál

source: Calculates the factorial of the current value in the display area. <replaceable>x</replaceable> factorial is <replaceable>x</replaceable>*(<replaceable>x</replaceable>-1)*(<replaceable>x</replaceable>-2)...*1. This function applies only to positive integers.
cs: Vypočítá faktoriál aktuální hodnoty na displeji. Faktoriál čísla <replaceable>x</replaceable> je <replaceable>x</replaceable>×(<replaceable>x</replaceable>-1)×(<replaceable>x</replaceable>-2)...×1. Tuto funkci lze použít pouze pro celá kladná čísla.

source: Modulus Division
cs: Zbytek po dělení

source: Divides the current integer value in the display area by the next integer number that you enter, displaying the remainder.
cs: Podělí aktuální celé číslo na displeji celým číslem, které zadáte následně a zobrazí zbytek.

source: Random Number Generator
cs: Generátor náhodných čísel

source: Generates a random number in the range 0.0 to 1.0 then displays the random number in the display area.
cs: Vygeneruje náhodné číslo z rozsahu 0.0 až 1.0 a zobrazí jej na displeji.

source: To Perform Programming Calculations
cs: Provádění programátorských výpočtů

source: To change to Programming mode, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Programming</guimenuitem></menuchoice>.
cs: Do programátorského režimu přepnete pomocí <menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Programátorská</guimenuitem></menuchoice>.

source: When you change to Programming mode, the following widget is displayed above the Base and Advanced mode buttons:
cs: Po přepnutí do programátorského režimu se na tlačítky základního a pokročilého režimu zobrazí ještě následující tlačítka:

source: <application>gcalctool</application> Programming Mode Buttons
cs: Tlačítka <application>gcalctool</application> v programátorském režimu

source: Shows <placeholder-1/> Programming mode buttons.
cs: Zobrazuje <placeholder-1/> tlačítka <application>gcalctool</application> v programátorském režimu

source: To Set the Numeric Base
cs: Nastavení číselné soustavy

source: To set the numeric base, select one of the buttons described in <xref linkend="gcalctool-TBL-num-base"/>.
cs: K nastavení číselné soustavy použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-num-base"/>.

source: Setting the Numeric Base
cs: Nastavení číselné soustavy

source: Binary Base
cs: Dvojková soustava

source: Sets the numeric base to binary, that is, base 2.
cs: Nastaví číselnou soustavu na dvojkovou, tj. se základem 2.

source: Octal Base
cs: Osmičková soustava

source: Sets the numeric base to octal, that is, base 8.
cs: Nastaví číselnou soustavu na osmičkovou, tj. se základem 8.

source: Decimal Base
cs: Desítková soustava

source: Sets the numeric base to decimal, that is, base 10. Decimal is the default numeric base. If you change from Programming mode to another mode, <application>gcalctool</application> automatically sets the numeric base to decimal.
cs: Nastaví číselnou soustavu na desítkovou, tj. se základem 10. Desítková soustava je výchozí. Pokud přepnete z programátorského režimu do jiného, tak <application>gcalctool</application> automaticky přepne na desítkovou číselnou soustavu.

source: Hexadecimal Base
cs: Šestnáctková soustava

source: Sets the numeric base to hexadecimal, that is, base 16.
cs: Nastaví číselnou soustavu na šestnáctkovou, tj. se základem 16.

source: To Perform Bit Manipulations on Integers
cs: Provádění bitových operací na celých číslech

source: If the calculator display shows an integer value, then each of the bits in that integer value is displayed as a collection of 0's and 1's in the Bit Editor. By clicking on any of these individual bits, their value can be toggled, causing the displayed integer value to be adjusted accordingly.
cs: Pokud je na displeji kalkulačky zobrazené celé číslo, lze jej vyjádřit jako posloupnost nul a jedniček v bitovém editoru. Kliknutím na kterýkoliv z těchto jednotlivých bitů můžete změnit jeho hodnotu a to se ihned příslušně odrazí v zobrazeném čísle.

source: To Perform Bitwise Calculations
cs: Provádění logických bitových operací

source: To perform bitwise calculations, use the buttons described in <xref linkend="gcalctool-TBL-logic-calc"/>.
cs: K provádění logických bitových operací použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-logic-calc"/>.

source: Performing Bitwise Calculations
cs: Provádění logických bitových operací

source: Bitwise OR
cs: Logické OR

source: Performs a bitwise OR operation on the current value in the display area and the next number that you enter, treating both numbers as unsigned long integers.
cs: Provede logickou operaci OR na bitech aktuální hodnoty na displeji a hodnoty, kterou následně zadáte. Obě čísla budou považována za dlouhá celá čísla bez znaménka.

source: Bitwise AND
cs: Logické AND

source: Performs a bitwise AND operation on the current value in the display area and the next number that you enter, treating both numbers as unsigned long integers.
cs: Provede logickou operaci AND na bitech aktuální hodnoty na displeji a hodnoty, kterou následně zadáte. Obě čísla budou považována za dlouhá celá čísla bez znaménka.

source: Bitwise NOT
cs: Logické NOT

source: Performs a bitwise NOT operation on the current value in the display area, treating the number as an unsigned long integer.
cs: Provede logickou operaci OR na bitech aktuální hodnoty na displeji. Čísla je považováno za dlouhé celé čísla bez znaménka.

source: Bitwise XOR
cs: Logické XOR

source: Performs a bitwise XOR operation on the current value in the display area and the next number that you enter, treating both numbers as unsigned long integers.
cs: Provede logickou operaci XOR na bitech aktuální hodnoty na displeji a hodnoty, kterou následně zadáte. Obě čísla budou považována za dlouhá celá čísla bez znaménka.

source: Bitwise XNOR
cs: Logické XNOR

source: Performs a bitwise XNOR operation on the current value in the display area and the next number that you enter, treating both numbers as unsigned long integers.
cs: Provede logickou operaci XNOR na bitech aktuální hodnoty na displeji a hodnoty, kterou následně zadáte. Obě čísla budou považována za dlouhá celá čísla bez znaménka.

source: To Manipulate Binary Numbers
cs: Operace s dvojkovými čísly

source: To manipulate binary numbers, use the buttons described in <xref linkend="gcalctool-TBL-num-manip"/>.
cs: K operacím s dvojkovými čísly použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-num-manip"/>.

source: Manipulating Binary Numbers
cs: Operace s dvojkovými čísly

source: Left Shift <replaceable>n</replaceable>
cs: Posun doleva o <replaceable>n</replaceable>

source: Shifts the current unsigned 32-bit binary value in the display area, the specified number of places to the left. Click <guibutton>&lt;</guibutton>, then select the number of shift places from the popup menu. The number can be shifted up to 15 places left.
cs: Posune aktuální 32bitovou dvojkovou hodnotu bez znaménka na displeji o zadaný počet míst doleva. Klikněte na <guibutton>&lt;</guibutton> a ve vyskakovací nabídce zvolte počet míst, o které se má posun provést. Posunout lze až o 15 míst doleva.

source: Right Shift <replaceable>n</replaceable>
cs: Posun doprava <replaceable>n</replaceable>

source: Shifts the current unsigned 32-bit binary value in the display area, the specified number of places to the right. Click <guibutton>&gt;</guibutton>, then select the number of shift places from the popup menu. The number can be shifted up to 15 places right.
cs: Posune aktuální 32bitovou dvojkovou hodnotu bez znaménka na displeji o zadaný počet míst doprava. Klikněte na <guibutton>&lt;</guibutton> a ve vyskakovací nabídce zvolte počet míst, o které se má posun provést. Posunout lze až o 15 míst doprava.

source: Get a 16-Bit Unsigned Integer
cs: Vrátí 16bitové celé číslo bez znaménka

source: Truncates the current value in the display area and returns a 16-bit unsigned integer.
cs: Ořízne aktuální hodnotu na displeji a vrátí 16bitové celé číslo bez znaménka.

source: Get a 32-Bit Unsigned Integer
cs: Vráti 32bitové celé číslo bez znaménka

source: Truncates the current value in the display area and returns a 32-bit unsigned integer.
cs: Ořízne aktuální hodnotu na displeji a vrátí 32bitové celé číslo bez znaménka.

source: If you use keyboard shortcuts, you can use the keyboard to specify the number of places to shift, as shown in the following examples:
cs: Pokud používáte klávesové zkratky, můžete z klávesnice zadat i počet míst, o které se má provést posun, tak jako v následujících příkladech:

source: Shifts the current binary value in the display area 4 places to the left.
cs: Posune aktuální hodnotu na displeji o 4 místa doleva.

source: Shifts the current binary value in the display area 4 places to the right.
cs: Posune aktuální hodnotu na displeji o 4 místa doprava.

source: To Perform Miscellaneous Programming Calculations
cs: Provádění různorodých programátorských výpočtů

source: To perform miscellaneous programming calculations, use the buttons described in <xref linkend="gcalctool-TBL-misc-prog"/>.
cs: K provádění dalších programátorských výpočtů použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-misc-prog"/>.

source: Performing Miscellaneous Programming Calculations
cs: Provádění různorodých programátorských výpočtů

source: Hexadecimal Numerals
cs: Šestnáctkové číslice

source: <guibutton>A</guibutton> to <guibutton>F</guibutton> inclusive
cs: <guibutton>A</guibutton> až <guibutton>F</guibutton>

source: These numerals are available in hexadecimal base only.
cs: Tyto číslice jsou dostupné pouze v šestnáctkové číselné soustavě.

source: To Undo and Redo
cs: Funk zpět a znovu

source: To undo your previous action, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Undo</guimenuitem></menuchoice>. You can undo up to 15 past actions.
cs: Pokud chcete vrátit zpět svůj předchozí úkon, zvolte <menuchoice><guimenu>Upravit</guimenu><guimenuitem>Zpět</guimenuitem></menuchoice>. Můžete vrátit zpět až 15 posledních úkonů.

source: If you want to redo an action you just undo'ed, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Redo</guimenuitem></menuchoice>. You can redo up to 15 undo'ed actions.
cs: Pokud chcete znovu provést úkon, který jste právě vrátili zpět, tak zvolte <menuchoice><guimenu>Upravit</guimenu><guimenuitem>Znovu</guimenuitem></menuchoice>. Znovu provést můžete až 15 vrácených úkonů.

source: To Quit
cs: Ukončení

source: To quit <application>gcalctool</application>, choose <menuchoice><guimenu>Calculator</guimenu><guimenuitem>Quit</guimenuitem></menuchoice>.
cs: K ukončení <application>gcalctool</application> zvolte <menuchoice><guimenu>Kalkulačka</guimenu><guimenuitem>Ukončit</guimenuitem></menuchoice>.

source: When you quit <application>gcalctool</application>, the current values of the following settings are stored and automatically applied the next time you start <application>gcalctool</application>:
cs: Při ukončení <application>gcalctool</application> se automaticky zapamatují aktuální hodnoty následujících nastavení a při dalším spuštění <application>gcalctool</application> se obnoví do stejného stavu:

source: Mode: <link linkend="gcalctool-basic-mode">Basic</link>, <link linkend="gcalctool-advanced-mode">Advanced</link>, <link linkend="gcalctool-financial-mode">Financial</link>, or <link linkend="gcalctool-scientific-mode">Scientific</link>
cs: Režim: <link linkend="gcalctool-basic-mode">Základní</link>, <link linkend="gcalctool-advanced-mode">Pokročilý</link>, <link linkend="gcalctool-financial-mode">Finanční</link>, or <link linkend="gcalctool-scientific-mode">Vědecký</link>

source: <link linkend="gcalctool-mem-reg">Memory Registers window</link> displayed or not displayed, plus the contents of each memory register
cs: Zda je nebo není zobrazené <link linkend="gcalctool-mem-reg">okno paměťových registrů</link> plus obsah každého paměťového registru.

source: Numeric base
cs: Číselná soustava

source: Display type
cs: Typ displeje

source: Trigonometric type
cs: Trigonometrické jednotky

source: Show Trailing Zeroes
cs: Zobrazování koncových nul

source: Show Thousands Separator
cs: Zobrazování oddělovače tisíců

source: Technical Information
cs: Technické informace

source: Order of Operations
cs: Pořadí operací

source: By default, calculations are performed using arithmetic precedence. That is, the precedence of the arithmetic operators is taken into consideration and the result is only calculated when you click <guibutton>Return</guibutton>.
cs: Standardně se výpočty provádějí s použitím priority operací. To znamená, že se bere v úvahu priorita aritmetických operací a výsledky se zobrazí až po stisknutí <guibutton>Return</guibutton>.

source: In the following example, the result of the calculation is 22 because the multiplication operator, <literal>*</literal>, has precedence over the addition operator, <literal>+</literal>.
cs: V následujícím příkladu je výsledek výpočtu 22, protože operace násobení <literal>×</literal> má přednost před operací sčítání <literal>+</literal>.

source: If you do not wish to apply arithmetic precedence to your calculations, select <menuchoice><guimenu>View</guimenu><guimenuitem>Left-to-right Precedence</guimenuitem></menuchoice>.
cs: Pokud si nepřejete při výpočtech používat prioritu aritmetických operací, tak zvolte <menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Priorita zleva doprava</guimenuitem></menuchoice>.

source: If you choose not to apply arithmetic precedence, then the result the calculation in the example is 42 because the calculation is performed from left to right.
cs: Pokud vypnete používání priority operací, tak výsledek ukázkového výpočtu bude 42, protože výpočet bude probíhat zleva doprava.

source: Error Conditions
cs: Chybové stavy

source: Displays the word <literal>Error</literal> in the display area.
cs: Zobrazí na displeji slovo <literal>Chyba</literal>

source: Displays an error message in the status bar.
cs: Ve stavovém řádku zobrazí chybovou zprávu.

source: Makes all calculator buttons unavailable, except <guibutton>Clr</guibutton>.
cs: Znepřístupní všechna tlačítka kalkulačky s výjimkou <guibutton>Clr</guibutton>.

source: Makes all calculator options unavailable.
cs: Znepřístupní všechny volby kalkulačky.

source: Makes all calculator menu items unavailable, except <menuchoice><guimenu>Calculator</guimenu><guimenuitem>Quit</guimenuitem></menuchoice> and <menuchoice><guimenu>Help</guimenu><guimenuitem>Contents</guimenuitem></menuchoice>.
cs: Znepřístupní všechny nabídky kalkulačky vyjma <menuchoice><guimenu>Kalkulačka</guimenu><guimenuitem>Ukončit</guimenuitem></menuchoice> a <menuchoice><guimenu>Nápověda</guimenu><guimenuitem>Obsah</guimenuitem></menuchoice>.

source: If you perform an invalid calculation, <application>gcalctool</application> indicates the error condition as follows: <placeholder-1/>
cs: V případě, že provedete neplatný výpočet, <application>gcalctool</application> následovně signalizuje chybový stav: <placeholder-1/>

source: To clear the error condition, click <guibutton>Clr</guibutton> or press <keycombo><keycap>Shift</keycap><keycap>Delete</keycap></keycombo>.
cs: Chybový stav zrušíte kliknutím na <guibutton>Clr</guibutton> nebo zmáčknutím <keycombo><keycap>Shift</keycap><keycap>Delete</keycap></keycombo>.

source: Changing Modes
cs: Změny režimů

source: If the user tries to change modes when a partial calculation is being displayed, a warning dialog is displayed, telling the user that the current calculation will be cleared, and the base will be reset to decimal.
cs: Když se uživatel pokusí změnit režim během nedokončeného výpočtu, objeví se dialog s varování. Upozorní uživatele, že současný výpočet bude smazán a číselná soustava přepnuta na desítkovou.

source: There is a checkbox present, that if checked, prevents the dialog from being shown again.
cs: K dispozici je přepínač, kterým můžete toto hlášení napříště zakázat.

source: Clears the display.
cs: Vymazání displeje.

source: Sets the base to decimal.
cs: Nastavení číselné soustavy na desítkovou.

source: Sets the numeric display to fixed.
cs: Nastavení typu displeje s pevnou čárkou.

source: Sets the accuracy to nine places after the numeric point.
cs: Nastavení přesnosti výpočtu na devět platných desetinných míst.

source: Clears the display of the thousands separator.
cs: Vypnutí zobrazování oddělovače tisíců.

source: Clears the display of trailing zeroes after the numeric point.
cs: Vypnutí zobrazování koncových nul za desetinnou čárkou.

source: Dismisses the register window if the new mode is Basic.
cs: Pokud je zvoleným režimem základní, tak se skryje okno s paměťovými registry.

source: If the user presses the <guibutton>Cancel</guibutton> button, the change mode operation is cancelled. If the user presses the <guibutton>Change Mode</guibutton> button, the mode is changed and has the following side-effects: <placeholder-1/>
cs: Pokud uživatel stiskne tlačítko <guibutton>Zrušit</guibutton>, přepnutí režimu se zruší. Pokud zmáčkne tlačítko <guibutton>Změnit režim</guibutton>, změna režimu se provede a bude mít následující efekty: <placeholder-1/>

source: Changing The Display Area
cs: Změny v oblasti displeje

source: In arithmetic precedence mode, it is possible to use the mouse to click on the display area and edit it.
cs: V režimu priority operací je možné použít myš ke kliknutí do oblasti displeje a jeho úpravě.

source: <keycombo><keycap>Ctrl</keycap><keycap>Delete</keycap></keycombo> which will delete the character to the right of the text cursor
cs: <keycombo><keycap>Ctrl</keycap><keycap>Delete</keycap></keycombo> vymaže znak napravo od textového kurzoru

source: <keycap>Home</keycap> which moves the text cursor to the beginning of the display area
cs: <keycap>Home</keycap> přesune textový kurzor na začátek displeje.

source: <keycap>End</keycap> which moves the text cursor to the end of the display area
cs: <keycap>End</keycap> přesune textový kurzor na konec displeje.

source: All the normal keyboard shortcuts will work, plus the addition of: <placeholder-1/>
cs: Fungují všechny normální klávesové zkratky plus tyto další: <placeholder-1/>

source: Quick Reference: Keyboard Shortcuts
cs: Rychlý přehled: Klávesové zkratky

source: <xref linkend="gcalctool-TBL-keyboard-shortcut-button"/>, <xref linkend="gcalctool-TBL-keyboard-shortcut-sci-options"/>, and <xref linkend="gcalctool-TBL-keyboard-shortcut-menu"/> provide a quick reference for all of the <application>gcalctool</application> keyboard shortcuts.
cs: <xref linkend="gcalctool-TBL-keyboard-shortcut-button"/>, <xref linkend="gcalctool-TBL-keyboard-shortcut-sci-options"/> a <xref linkend="gcalctool-TBL-keyboard-shortcut-menu"/> poskytují rychlý přehled všech klávesových zkratek aplikace <application>gcalctool</application>.

source: When you use the keyboard shortcut for any of the calculator buttons that have a menu associated with them, that menu is displayed. You can then use the arrow keys to select a menu item or the menu item's shortcut.
cs: Pokud použijete klávesovou zkratku pro některé z tlačítek kalkulačky, které má přidruženou nabídku, tak ta se zobrazí. Pro výběr položky z této nabídky můžete použít šipky nebo zkratky jednotlivých položek.

source: Quick Reference for Keyboard Shortcuts of <application>gcalctool</application> Buttons
cs: Rychlý přehled klávesových zkratek pro tlačítka aplikace <application>gcalctool</application>

source: Keyboard Shortcut
cs: Klávesová zkratka

source: See
cs: Viz

source: <keycap>0</keycap> to <keycap>9</keycap> inclusive
cs: <keycap>0</keycap> až <keycap>9</keycap>

source: Hexadecimal numerals
cs: Šestnáctková číslice

source: Double-declining depreciation
cs: Dvojitě degresivní odpis

source: Exponential
cs: Exponent
