Repository: GNOME/gnome-calculator
Catalog: help/*/*.po
Languages: cs

source: @@image: 'figures/gcalctool_basic_window.png'; md5=266c80591f59cde9e20068c49a908738
cs: @@image: 'figures/gcalctool_basic_window.png'; md5=e42903cce8ff9ec0dd674f55230939cd

source: @@image: 'figures/gcalctool_scientific_window.png'; md5=4133fbe04054112a4958c836be98da0b
cs: @@image: 'figures/gcalctool_scientific_window.png'; md5=d8d240e02d2b43d8d0c73c40a9626115

source: <application>gcalctool</application> Manual
cs: Příručka k aplikaci <application>gcalctool</application>

source: gcalctool is a calculator for GNOME. It includes basic, advanced, financial, and scientific modes and uses a multiple precision package to do its arithmetic to give a high degree of accuracy.
cs: gcalctool je kalkulačka pro GNOME. Umí pracovat v základním, pokročilém, finančním a vědeckém režimu a používá balíčky pro práci s různou přesností, aby se zajistila vysoká správnost výsledků.

source: GNOME Documentation Project
cs: Dokumentační projekt GNOME

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License (GFDL), Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You can find a copy of the GFDL at this <ulink type="help" url="ghelp:fdl">link</ulink> or in the file COPYING-DOCS distributed with this manual.
cs: Je povoleno kopírovat, šířit a/nebo upravovat tento dokument za podmínek GNU Free Documentation License, verze 1.1 nebo jakékoli další verze vydané nadací Free Software Foundation; bez neměnných oddílů, bez textů předních desek a bez textů zadních desek. Kopie této licence je zahrnuta v oddílu jménem <ulink type="help" url="ghelp:fdl">GNU Free Documentation License</ulink> nebo v souboru COPYING-DOCS dodávaném s touto příručkou.

source: This manual is part of a collection of GNOME manuals distributed under the GFDL. If you want to distribute this manual separately from the collection, you can do so by adding a copy of the license to the manual, as described in section 6 of the license.
cs: Tato příručka je součástí kolekce příruček GNOME, distribuovaných pod licencí GNU FDL. Pokud chcete tento dokument šířit odděleně od kolekce, musíte přiložit kopii licence dle popisu v sekci 6 dané licence.

source: Many of the names used by companies to distinguish their products and services are claimed as trademarks. Where those names appear in any GNOME documentation, and the members of the GNOME Documentation Project are made aware of those trademarks, then the names are in capital letters or initial capital letters.
cs: Mnoho užívaných jmen určených k zviditelnění produktů nebo služeb jsou ochranné známky. Na místech, kde jsou tato jména v dokumentaci užita a členové Dokumentačního projektu GNOME jsou si vědomi skutečnosti, že se jedná o ochrannou známku, je takové jméno psáno velkými písmeny celé nebo s velkým písmenem na začátku.

source: DOCUMENT IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS FREE OF DEFECTS MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY, ACCURACY, AND PERFORMANCE OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS WITH YOU. SHOULD ANY DOCUMENT OR MODIFIED VERSION PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL WRITER, AUTHOR OR ANY CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER; AND
cs: DOKUMENT JE POSKYTOVÁN V PODOBĚ „JAK JE“ BEZ ZÁRUKY V JAKÉKOLIV PODOBĚ, NEPOSKYTUJÍ SE ANI ODVOZENÉ ZÁRUKY, ZÁRUKY, ŽE DOKUMENT, NEBO JEHO UPRAVENÁ VERZE, JE BEZCHYBNÝ NEBO ZÁRUKY PRODEJNOSTI, VHODNOSTI PRO URČITÝ ÚČEL NEBO NEPORUŠENOSTI. RIZIKO NEKVALITY, NEPŘESNOSTI A ŠPATNÉHO PROVEDENÍ DOKUMENTU, NEBO JEHO UPRAVENÉ VERZE, LEŽÍ NA VÁS. POKUD KVŮLI TOMUTO DOKUMENTU, NEBO JEHO UPRAVENÉ VERZI, NASTANE PROBLÉM, VY (NIKOLIV PŮVODNÍ AUTOR NEBO JAKÝKOLIV PŘISPĚVATEL) PŘEBÍRÁTE JAKÉKOLIV NÁKLADY ZA NUTNÉ ÚPRAVY, OPRAVY ČI SLUŽBY. TOTO PROHLÁŠENÍ O ZÁRUCE PŘEDSTAVUJE ZÁKLADNÍ SOUČÁST TÉTO LICENCE. BEZ TOHOTO PROHLÁŠENÍ NENÍ, PODLE TÉTO DOHODY, POVOLENO UŽÍVÁNÍ ANI ÚPRAVY TOHOTO DOKUMENTU; DÁLE

source: UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER IN TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE AUTHOR, INITIAL WRITER, ANY CONTRIBUTOR, OR ANY DISTRIBUTOR OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER DAMAGES OR LOSSES ARISING OUT OF OR RELATING TO USE OF THE DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES.
cs: ZA ŽÁDNÝCH OKOLNOSTÍ A ŽÁDNÝCH PRÁVNÍCH PŘEDPOKLADŮ, AŤ SE JEDNÁ O PŘEČIN (VČETNĚ NEDBALOSTNÍCH), SMLOUVU NEBO JINÉ, NENÍ AUTOR, PŮVODNÍ PISATEL, KTERÝKOLIV PŘISPĚVATEL NEBO KTERÝKOLIV DISTRIBUTOR TOHOTO DOKUMENTU NEBO UPRAVENÉ VERZE DOKUMENTU NEBO KTERÝKOLIV DODAVATEL NĚKTERÉ Z TĚCHTO STRAN ODPOVĚDNÝ NĚJAKÉ OSOBĚ ZA PŘÍMÉ, NEPŘÍMÉ, SPECIÁLNÍ, NAHODILÉ NEBO NÁSLEDNÉ ŠKODY JAKÉHOKOLIV CHARAKTERU, VČETNĚ, ALE NEJEN, ZA POŠKOZENÍ ZE ZTRÁTY DOBRÉHO JMÉNA, PŘERUŠENÍ PRÁCE, PORUCHY NEBO NESPRÁVNÉ FUNKCE POČÍTAČE NEBO JINÉHO A VŠECH DALŠÍCH ŠKOD NEBO ZTRÁT VYVSTÁVAJÍCÍCH Z NEBO VZTAHUJÍCÍCH SE K POUŽÍVÁNÍ TOHOTO DOKUMENTU NEBO UPRAVENÝCH VERZÍ DOKUMENTU, I KDYŽ BY TAKOVÁTO STRANA BYLA INFORMOVANÁ O MOŽNOSTI TAKOVÉHOTO POŠKOZENÍ.

source: DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT ARE PROVIDED UNDER THE TERMS OF THE GNU FREE DOCUMENTATION LICENSE WITH THE FURTHER UNDERSTANDING THAT: <placeholder-1/>
cs: DOKUMENT A JEHO UPRAVENÉ VERZE JSOU ŠÍŘENY V SOULADU SE ZNĚNÍM LICENCE GNU FREE DOCUMENTATION LICENSE S NÁSLEDUJÍCÍM USTANOVENÍM: <placeholder-1/>

source: Calculator Manual V2.9
cs: Příručka V2.9 ke kalkulačce

source: March 2005
cs: Březen 2005

source: Sun Java Desktop System Documentation Team
cs: Dokumentační tým Sun Java Desktop System

source: Calculator Manual V2.8
cs: Manuál ke kalkulačce V2.8

source: August 2004
cs: Srpen 2004

source: gcalctool Manual V2.7
cs: Příručka V2.7 ke gcalctool

source: February 2004
cs: Únor 2004

source: Sun GNOME Documentation Team
cs: Dokumentační tým GNOME společnosti Sun

source: gcalctool Manual V2.6
cs: Příručka V2.6 ke gcalctool

source: October 2003
cs: Říjen 2003

source: gcalctool Manual V2.5
cs: Příručka V2.5 ke gcalctool

source: July 2003
cs: Červenec 2003

source: gcalctool Manual V2.4
cs: Příručka V2.4 ke gcalctool

source: June 2003
cs: Červen 2003

source: gcalctool Manual V2.3
cs: Příručka V2.3 ke gcalctool

source: April 2003
cs: Duben 2003

source: gcalctool Manual V2.2
cs: Příručka V2.2 ke gcalctool

source: gcalctool Manual V2.1
cs: Příručka V2.1 ke gcalctool

source: March 2003
cs: Březen 2003

source: gcalctool Manual V2.0
cs: Příručka V2.0 ke gcalctool

source: This manual describes version 5.5.37 of Calculator.
cs: Tato příručka popisuje Kalkulačku ve verzi 5.5.37

source: Feedback
cs: Ohlasy

source: To report a bug or make a suggestion regarding the <application>gcalctool</application> application or this manual, follow the directions in the <ulink url="ghelp:gnome-feedback" type="help">GNOME Feedback Page</ulink>.
cs: Pokud chcete oznámit chybu nebo navrhnout vylepšení vztahující se k aplikaci <application>gcalctool</application> nebo této příručce, postupujte dle instrukcí na stránce <ulink url="ghelp:gnome-feedback" type="help">Stránka s ohlasy na GNOME</ulink>.

source: Calculator
cs: Kalkulačka

source: Introduction
cs: Úvod

source: The <application>gcalctool</application> application provides the following modes for different types of mathematical functionality:
cs: Aplikace <application>gcalctool</application> nabízí následující režimy s různými typy matematické funkcionality:

source: Basic
cs: Základní

source: The default mode. Provides standard calculator functions. You can perform standard addition, subtraction, division, and multiplication functions in Basic mode and you can use all of the Basic functions in each of the other modes.
cs: Výchozí režim. Poskytuje standardní funkce kalkulačky. V základním režimu můžete provádět standardní funkce sčítání, odčítání, násobení a dělení. A všechny funkce základního režimu můžete použít v každém z dalších režimů.

source: Advanced
cs: Pokročilá

source: Provides advanced calculator functions. You can store numbers in 10 different memory registers, and easily retrieve and replace the numbers in the memory registers. You can use all of the Advanced functions in Financial, Scientific and Programming modes.
cs: Poskytuje funkce pokročilé kalkulačky. Můžete si ukládat číslo do 10 různých paměťových registrů a jednoduše si je z nich zase vytahovat a prohazovat je. Všechny pokročilé funkce můžete používat i v finančním, vědeckém a programátorském režimu.

source: Financial
cs: Finanční

source: Provides several complex financial functions.
cs: Poskytuje několik komplexních finančních funkcí.

source: Scientific
cs: Vědecká

source: Provides many additional mathematical functions, including trigonometric functions. You can also store your own functions and constants, when you use Scientific mode.
cs: Poskytuje další matematické funkce včetně trigonometrických funkcí. Ve vědeckém režimu si můžete také ukládat vlastní definice funkcí a konstant.

source: Programming
cs: Programátorská

source: Provides functions useful to a programmer, including bitwise functions and a bit editor.
cs: Poskytuje funkce vhodné pro programátory, včetně bitových operací a bitového editoru.

source: You can use <application>gcalctool</application> in the following numbering systems:
cs: <application>gcalctool</application> můžete používat v následujících číselných soustavách:

source: Numbering System
cs: Číselná soustava

source: Base
cs: Základ

source: Binary
cs: Dvojková

source: Octal
cs: Osmičková

source: Decimal
cs: Desítková

source: Hexadecimal
cs: Šestnáctková

source: Getting Started
cs: Jak začít

source: You can start <application>gcalctool</application> in the following ways:
cs: <application>gcalctool</application> můžete spustit následujícími způsoby:

source: Menu
cs: Nabídka

source: Choose <menuchoice><guimenu>Accessories</guimenu><guimenuitem>Calculator</guimenuitem></menuchoice>.
cs: Zvolte <menuchoice><guimenu>Příslušenství</guimenu><guimenuitem>Kalkulačka</guimenuitem></menuchoice>.

source: Command line
cs: Příkazový řádek

source: Execute the following command: <userinput>gnome-calculator</userinput>
cs: Spusťte následující příkaz: <userinput>gnome-calculator</userinput>

source: When you start <application>gcalctool</application>, the following window is displayed:
cs: Po spuštění <application>gcalctool</application> se objeví následující okno:

source: <application>gcalctool</application> Basic Mode Window
cs: Okno <application>gcalctool</application> v základním režimu

source: Shows <placeholder-1/> Basic mode window.
cs: Zobrazuje <placeholder-1/> okno <application>gcalctool</application> v základním režimu

source: The <application>gcalctool</application> window contains the following elements:
cs: Okno <application>gcalctool</application> obsahuje následující části:

source: Menubar
cs: Panel nabídek

source: The menus on the menubar contain all of the commands that you need to work with <application>gcalctool</application>.
cs: Nabídky v panelu nabídek obsahují všechny příkazy, které potřebujete k práci s <application>gcalctool</application>.

source: Display area
cs: Oblast displeje

source: The display area shows the numbers that you enter, and the results of calculations. If you are not using arithmetic precedence, you can only enter numbers of up to forty digits.
cs: V oblasti displeje se zobrazují čísla, která zadáte a výsledky výpočtů. Pokud nepoužíváte prioritu výpočtu, tak můžete zadat až čtyřicet číslic.

source: Mode area
cs: Oblast režimu

source: The mode area displays the buttons for the current mode. The Basic mode buttons are always displayed. Advanced mode buttons are also available in Financial, Scientific and Programming modes.
cs: V oblasti režimu se zobrazují tlačítka pro aktuální režim. Tlačítka základního režimu jsou zobrazená vždy. Tlačítka pokročilého režimu jsou dostupná také v režimech finančním, vědeckém a programátorském.

source: Popup Menu
cs: Vyskakovací nabídka

source: Shows popup-menu symbol.
cs: Zobrazuje symbol vyskakovací nabídky.

source: The <placeholder-1/> symbol on a <application>gcalctool</application> button indicates that a popup menu is displayed when you click on that button.
cs: Symbol <placeholder-1/> na tlačítku v <application>gcalctool</application> označuje, že po kliknutí na toto tlačítko se zobrazí vyskakovací nabídka.

source: Status Bar
cs: Stavový řádek

source: The status bar displays messages on the status of your calculations.
cs: Stavový řádek zobrazuje zprávy podle stavu vašich výpočtů.

source: Usage
cs: Použití

source: To Use Calculator Functions
cs: Používání funkcí kalkulačky

source: To perform a calculation, use one of the following methods:
cs: K provádění výpočtů použijte jeden z následujících postupů:

source: Click on the <application>gcalctool</application> buttons to enter numbers and functions.
cs: Klikáním na tlačítka <application>gcalctool</application> volte čísla a funkce.

source: Give focus to the <application>gcalctool</application> window, then use the keyboard or numeric keypad to specify the calculation that you want to perform. For a complete list of keyboard shortcuts, see <xref linkend="gcalctool-keyboard-shortcut"/>.
cs: Přepněte se do okna aplikace <application>gcalctool</application> a používejte klávesnici (včetně číselné klávesnice) k zadávání výpočtů, které chcete provádět. Úplný přehled klávesových zkratek najdete v <xref linkend="gcalctool-keyboard-shortcut"/>.

source: The <application>gcalctool</application> application automatically displays numbers with more than 40 digits, and small numbers, as exponential numbers. For example, the following table shows the value that is displayed when you use the decimal numeric base with an accuracy of 2 significant places:
cs: Aplikace <application>gcalctool</application> zobrazuje čísla, která mají více než 40 číslic nebo jsou příliš malá, automaticky v exponenciálním tvaru. Například následující tabulka ukazuje hodnoty, které se zobrazí, pokud použijete desítkovou soustavu s přesností na dvě desetinná místa:

source: Display
cs: Zobrazení

source: Signifies
cs: Význam

source: For information about how to enter a number in exponential format, see <xref linkend="gcalctool-enter-exp"/>.
cs: Více informací o tom, jak zadávat čísla v exponenciálním tvaru, najdete v: <xref linkend="gcalctool-enter-exp"/>.

source: To Display a Separator in Large Numbers
cs: Zobrazení oddělovačů u velkých čísel

source: To insert a separator between every three digits to the left of the numeric point in decimal base, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Show Thousands Separator</guimenuitem></menuchoice>.
cs: Pokud chcete, aby se mezi každé tři číslice nalevo od desetinné čárky vkládal oddělovač, tak zvolte menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Zobrazovat oddělovač tisíců</guimenuitem></menuchoice>.

source: Different countries and cultures have varying conventions for how to communicate. These conventions include the language spoken and the character used as a numeric separator.
cs: Různé země a kultury mají rozdílné konvence pro komunikaci. Tyto konvence zahrnují mimo např. jazyka i znak použitý pro oddělování číslic.

source: <application>gcalctool</application> has been internationalized so user's can adapt to their own conventions. This is done by setting a specific locale. We can't determine what locales will exist, except for a standard one called the C locale.
cs: <application>gcalctool</application> je připravený pro práci v mezinárodním prostředí, takže si jej uživatel může přizpůsobit svým konvencím. Dělá se to přes místní nastavení. Nemůžeme dopředu vědět, jaká všechna místní nastavení budou existovat, kromě jednoho standardního, označovaného „C“.

source: When you use the C locale, the separator character is not displayed.
cs: Pokud použijete místní nastavení C (C locale), tak se oddělovací znak nebude zobrazovat.

source: To Copy and Paste in the Display Area
cs: Kopírování a vkládání v oblasti displeje

source: To copy the result of a calculation, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Copy</guimenuitem></menuchoice>. You can paste the value into another application.
cs: Pokud chcete zkopírovat výsledek výpočtu, tak zvolte <menuchoice><guimenu>Upravit</guimenu><guimenuitem>Kopírovat</guimenuitem></menuchoice>. Hodnotu můžete potom vložit do jiné aplikace.

source: To paste a previously copied value into the display area, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem></menuchoice>.
cs: Pokud chcete na displej vložit hodnotu, kterou máte ve schránce, tak zvolte <menuchoice><guimenu>Upravit</guimenu><guimenuitem>Vložit</guimenuitem></menuchoice>.

source: To Perform Basic Calculations
cs: Provádění základních výpočtů

source: Basic mode is displayed by default when you first start <application>gcalctool</application>. To explicitly invoke Basic mode, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Basic</guimenuitem></menuchoice>.
cs: Základní režim se zobrazí jako výchozí při prvním spuštění <application>gcalctool</application>. Pokud se v budoucnu budete chtít přepnout do základního režimu, stačí zvolit <menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Základní</guimenuitem></menuchoice>.

source: The calculator memory registers are unavailable in Basic Mode. In other words, <menuchoice><guimenu>View</guimenu><guimenuitem>Memory Registers</guimenuitem></menuchoice> is inactive.
cs: V základním režimu nejsou dostupné paměťové registry. Z toho důvodu je zakázaná volba <menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Paměťové registry</guimenuitem></menuchoice>.

source: To Perform Simple Calculations
cs: Provádění jednoduchých výpočtů

source: To perform simple calculations, use the buttons described in <xref linkend="gcalctool-TBL-simple-calc"/>.
cs: K provádění jednoduchých výpočtů použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-simple-calc"/>.

source: Performing Simple Calculations
cs: Provádění jednoduchých výpočtů

source: Function
cs: Funkce

source: Button
cs: Tlačítko

source: Description
cs: Popis

source: Example
cs: Příklad

source: Result
cs: Výsledek

source: Numerals
cs: Číslice

source: <guibutton>0</guibutton> to <guibutton>9</guibutton> inclusive
cs: <guibutton>0</guibutton> až <guibutton>9</guibutton>

source: In decimal and hexadecimal base, all numerals are available. In octal base, <guibutton>8</guibutton> and <guibutton>9</guibutton> are unavailable. In binary base, only <guibutton>0</guibutton> and <guibutton>1</guibutton> are available. The default base is decimal.
cs: V desítkové a šestnáctkové soustavě jsou dostupné všechny číslice. V osmičkové soustavě jsou číslice <guibutton>8</guibutton> a <guibutton>9</guibutton> zakázané. Ve dvojkové soustavě jsou povolené pouze číslice <guibutton>0</guibutton> a <guibutton>1</guibutton>. Základní číselnou soustavou je desítková.

source: Numeric point
cs: Desetinná čárka

source: Starts the fractional part of a numeric entry.
cs: Začíná desetinnou část zadaného čísla.

source: Calculate a result
cs: Spočítat výsledek

source: Displays the result of the current calculation in the current base.
cs: Zobrazí výsledek aktuálního výpočtu v aktuální číselné soustavě.

source: Addition
cs: Sčítání

source: Adds the current value in the display area to the next number that you enter.
cs: Současnou hodnotu na displeji přičte k číslu, které zadáte jako následující.

source: Subtraction
cs: Odečítání

source: Subtracts from the current value in the display area the next number that you enter.
cs: Od současné hodnoty na displeji odečte číslo, které zadáte jako následující.

source: Multiplication
cs: Násobení

source: Multiplies the current value in the display area by the next number that you enter.
cs: Současnou hodnotu na displeji vynásobí číslem, které zadáte jako následující.

source: Division
cs: Dělení

source: Divides the current value in the display area by the next number that you enter.
cs: Současnou hodnotu na displeji podělí číslem, které zadáte jako následující.

source: Change the arithmetic sign
cs: Změna znaménka

source: Changes a positive number to a negative number, or a negative number to a positive number.
cs: Změní kladné číslo na záporné nebo naopak záporné na kladné.

source: To Erase Characters
cs: Mazání znaků

source: To erase characters, use the buttons described in <xref linkend="gcalctool-TBL-erase-char"/>.
cs: Na mazání znaků použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-erase-char"/>.

source: Erasing Characters
cs: Mazací znaky

source: Backspace
cs: Smazat znak (Backspace)

source: Removes the rightmost character from the display area.
cs: Smaže z displeje znak nejvíc vpravo.

source: Clear Entry
cs: Smazat vstup (Clear Entry)

source: Removes the current value from the display area.
cs: Smaže z displeje současnou hodnotu.

source: This is only really meaningful if the Calculator is not in Arithmetic Precedence mode.
cs: Praktický význam to má pouze v případě, že kalkulačka není v režimu priority operací.

source: In Arithmetic Precedence mode, this operation is the same as <guibutton>Clr</guibutton>
cs: V režimu priority operací funguje stejně jako <guibutton>Clr</guibutton>

source: If the calculator is not in Arithmetic Precedence mode:
cs: Pokud není kalkulačka v režimu priority operací:

source: If the calculator is in Arithmetic Precedence mode:
cs: Pokud je kalkulačka v režimu priority operací.

source: Clear
cs: Smazat (Clear)

source: Resets the current value in the display area to zero and removes any previous calculation results. <guibutton>Clr</guibutton> also deselects the <guilabel>Hyp</guilabel> and <guilabel>Inv</guilabel> options in Scientific.
cs: Nastaví aktuální hodnotu na displeji na nulu a smaže předchozí výsledky výpočtů. <guibutton>Clr</guibutton> také smaže volby <guilabel>Hyp</guilabel> a <guilabel>Inv</guilabel> ve vědeckém režimu.

source: To Display ASCII Values
cs: Zobrazení ASCII hodnot

source: To display the ASCII value of a character, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Insert ASCII Value</guimenuitem></menuchoice>.
cs: Pokud chcete zobrazit ASCII hodnotu znaku, tak zvolte <menuchoice><guimenu>Upravit</guimenu><guimenuitem>Vložit ASCII hodnotu znaku</guimenuitem></menuchoice>.

source: The Insert ASCII Value dialog is displayed.
cs: Objeví se dialog Vložit hodnotu ASCII.

source: Enter the required character in the <guilabel>Character</guilabel> field, then click <guibutton>Insert</guibutton>. The ASCII value of that character, in the current numeric base, appears in the display area. For example, the ASCII value of B in decimal base is 66.
cs: Vložte požadovaný znak do pole <guilabel>Znak</guilabel> a klikněte na <guibutton>Vložit</guibutton>. Na displeji se objeví ASCII hodnota zadaného znaku v aktuální číselné soustavě. Například ASCII hodnota znaku B je desítkově 66.

source: To Perform Advanced Calculations
cs: Provádění pokročilých výpočtů
