Repository: GNOME/gnome-calculator
Catalog: help/*/*.po
Languages: cs

source: Common base 10 logarithm
cs: Desítkový logaritmus

source: Common base 2 logarithm
cs: Dvojkový logaritmus

source: Integer portion
cs: Celá část

source: Inverse Cosine
cs: Inverzní kosinus

source: Cosine
cs: Kosinus

source: Inverse Sine
cs: Inverzní sinus

source: Sine
cs: Sinus

source: Straight-line depreciation
cs: Lineární odpis

source: Compounding term
cs: Doba úročení

source: Natural logarithm
cs: Přirozený logaritmus

source: x to the reciprocal<replaceable>y</replaceable> power
cs: x umocněno na převrácenou hodnotu <replaceable>y</replaceable>

source: <keycap>o</keycap> or <keycap>^</keycap>
cs: <keycap>o</keycap> nebo <keycap>^</keycap>

source: Periodic payment
cs: Pravidelná splátka

source: Present value
cs: Současná hodnota

source: Retrieve value from memory register
cs: Vytáhne hodnotu z paměťového registru

source: Store value in memory register
cs: Uloží hodnotu do paměťového registru

source: Square root
cs: Druhá odmocnina

source: Periodic interest rate
cs: Úroková sazba za období

source: Payment period
cs: Platební období

source: Absolute value
cs: Absolutní hodnota

source: Future value
cs: Budoucí hodnota

source: Inverse Tan
cs: Inverzní tangens

source: Exchange memory register value and displayed value
cs: Změní hodnoty mezi paměťovým registrem a displejem

source: Sum-of-the-years'-digits depreciation
cs: Hodnota degresivního odpisu pro období

source: <replaceable>x</replaceable> factorial
cs: <replaceable>x</replaceable> faktoriál

source: Constant value
cs: Konstantní hodnota

source: <keycap>(</keycap> and <keycap>)</keycap>
cs: <keycap>(</keycap> a <keycap>)</keycap>

source: Fractional portion
cs: Desetinná část

source: Left shift <replaceable>n</replaceable>
cs: Posun doleva o <replaceable>n</replaceable>

source: <keycap>=</keycap> or <keycap>Return</keycap>
cs: <keycap>=</keycap> nebo <keycap>Return</keycap>

source: Right shift <replaceable>n</replaceable>
cs: Posun doprava o <replaceable>n</replaceable>

source: Random number generator
cs: Generátor náhodných čísel

source: Get a 32-bit unsigned integer
cs: Vrátí 32bitové celé číslo bez znaménka

source: Get a 16-bit unsigned integer
cs: Vrátí 16bitové celé číslo bez znaménka

source: <keycap>Esc</keycap> or
cs: <keycap>Esc</keycap> nebo

source: Clear entry
cs: Smazat vstup

source: Quick Reference for Keyboard Shortcuts of <application>gcalctool</application> Scientific Mode Options
cs: Rychlý přehled klávesových zkratek pro volby vědeckého režimu aplikace <application>gcalctool</application>

source: Option
cs: Volba

source: Set the trigonometric type to gradians.
cs: Nastaví trigonometrické jednotky na grady.

source: Set the numeric base to binary.
cs: Nastaví číselnou soustavu na dvojkovou.

source: Set the numeric base to decimal.
cs: Nastaví číselnou soustavu na desítkovou.

source: Set the display type to fixed-point format.
cs: Nastaví typ displeje na formát s pevnou čárkou.

source: Set the trigonometric type to degrees.
cs: Nastaví trigonometrické jednotky na stupně.

source: Select the inverse option for use with the trigonometric functions.
cs: Přepne přepínač inverzní varianty trigonometrických funkcí.

source: Set the display type to engineering format.
cs: Nastaví typ displeje na inženýrský formát.

source: Set the numeric base to octal.
cs: Nastaví číselnou soustavu na osmičkovou.

source: Set the trigonometric type to radians.
cs: Nastaví trigonometrické jednotky na radiány.

source: Set the display type to scientific format.
cs: Nastaví typ displeje na vědecký formát.

source: Set the numeric base to hexadecimal.
cs: Nastaví číselnou soustavu na šestnáctkovou.

source: Select the hyperbolic option for use with the trigonometric functions.
cs: Přepne přepínač hyperbolické varianty trigonometrických funkcí.

source: Quick Reference for Keyboard Shortcuts of <application>gcalctool</application> Menu Items
cs: Rychlý přehled klávesových zkratek položek nabídek aplikace <application>gcalctool</application>

source: Menu Item
cs: Položka nabídky

source: View
cs: Zobrazit

source: Change to Basic mode
cs: Přepne do základního režimu

source: Edit
cs: Upravit

source: Copy
cs: Kopírovat

source: Copy the current value in the display area to the clipboard
cs: Zkopíruje aktuální hodnotu na displeji do schránky

source: Change to Financial mode
cs: Přepne do finančního režimu

source: Help
cs: Nápověda

source: Contents
cs: Obsah

source: Display the <application>gcalctool</application> online help
cs: Zobrazí nápovědu k aplikaci <application>gcalctool</application>

source: Insert ASCII Value
cs: Vložit ASCII hodnotu znaku

source: Display the <guilabel>Insert ASCII Value</guilabel> dialog
cs: Zobrazí dialog <guilabel>Vložit hodnotu ASCII</guilabel>

source: Display the thousands separator
cs: Zobrazí oddělovače tisíců

source: Left-to-right Precedence
cs: Priorita zleva doprava

source: Calculate results using left-to-right precedence
cs: Počítá výsledky s prioritou zleva doprava

source: Memory Registers
cs: Paměťové registry

source: Display the <guilabel>Memory Registers</guilabel> window
cs: Zobrazí okno <guilabel>Paměťových registrů</guilabel>

source: Change to Programming mode
cs: Přepne do programátorského režimu

source: Quit
cs: Ukončit

source: Quit the <application>gcalctool</application> application
cs: Ukončí aplikaci <application>gcalctool</application>

source: Arithmetic Precedence
cs: Priorita aritmetických operací

source: Calculate results using arithmetic precedence
cs: Počítá výsledky s prioritou podle aritmetických operací

source: Change to Scientific mode
cs: Přepne do vědeckého režimu

source: Show trailing zeroes
cs: Zobrazit koncové nuly

source: Paste
cs: Vložit

source: Paste the current value in the clipboard to the display area
cs: Vloží aktuální hodnotu ve schránce na displej

source: Undo
cs: Zpět

source: Undo previous action
cs: Vrátí zpět předchozí úkon

source: Redo
cs: Znovu

source: Redo an undo'ed action
cs: Provede znovu vrácený úkon

source: translator-credits
cs: Marek Černocký <marek@manet.cz>, 2009. Lucas Lommer <llommer@svn.gnome.org>, 2009.
