Repository: GNOME/gnome-calculator
Catalog: help/*/*.po
Languages: cs

source: To change to Advanced mode, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Advanced</guimenuitem></menuchoice>.
cs: Do pokročilého režimu přepnete volbou <menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Pokročilá</guimenuitem></menuchoice>.

source: When you change to Advanced mode, the following buttons are displayed to the right of the Basic mode buttons:
cs: Po přepnutí do pokročilého režimu se napravo od tlačítek základního režimu zobrazí ještě následující tlačítka:

source: <application>gcalctool</application> Advanced Mode Buttons
cs: Tlačítka <application>gcalctool</application> v pokročilém režimu

source: Shows <placeholder-1/> Advanced mode buttons.
cs: Zobrazuje <placeholder-1/> tlačítka <application>gcalctool</application> v pokročilém režimu

source: Performing Advanced Calculations
cs: Provádění pokročilých výpočtů

source: Percentage
cs: Procenta

source: Divides the current value by 100.
cs: Podělí aktuální hodnotu stem.

source: Reciprocal
cs: Převrácená hodnota

source: Divides 1 by the current value in the display area.
cs: Podělí 1 aktuální hodnotou na displeji.

source: Square Root
cs: Druhá odmocnina

source: Calculates the square root of the current value in the display area.
cs: Vypočítá druhou odmocninu z aktuální hodnoty na displeji.

source: For arithmetic precedence mode:
cs: Pro režim priority operací:

source: For non-arithmetic precedence mode:
cs: Bez režimu priority operací:

source: Square
cs: Druhá mocnina

source: Calculates the square of the current value in the display area.
cs: Vypočítá druhou mocninu aktuální hodnoty na displeji.

source: Integer Portion
cs: Celá část

source: Calculates the integer portion of the current value in the display area.
cs: Vypočítá celou část z aktuální hodnoty na displeji.

source: Fractional Portion
cs: Desetinná část

source: Calculates the fractional portion of the current value in the display area.
cs: Vypočítá desetinnou část z aktuální hodnoty na displeji.

source: Absolute Value
cs: Absolutní hodnota

source: Calculates the absolute value of the current value in the display area.
cs: Vypočítá absolutní hodnotu z aktuální hodnoty na displeji.

source: Parentheses
cs: Závorky

source: <guibutton>(</guibutton> and <guibutton>)</guibutton>
cs: <guibutton>(</guibutton> a <guibutton>)</guibutton>

source: Provide precedence in arithmetic calculations if you are not using Arithmetic Precedence. See also <xref linkend="gcalctool-manage-order"/>. Calculations within parentheses are performed first. You can nest parentheses to any level. When the last parenthesis is matched, the display area is updated.
cs: Pomůže vám měnit prioritu operací i když není zapnutý režim priority operací. Další informace najdete v <xref linkend="gcalctool-manage-order"/>. Výpočty v závorkách se provádí jako první. Závorky můžete libovolně zanořovat. Po uzavření poslední závorky se displej aktualizuje.

source: To Use the Calculator Memory Registers
cs: Použití paměťových registrů kalkulačky

source: You can store values in any of the ten <application>gcalctool</application> memory registers <guilabel>R0</guilabel> to <guilabel>R9</guilabel>. To display the memory registers, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Memory Registers</guimenuitem></menuchoice>.
cs: Hodnoty si můžete v <application>gcalctool</application> ukládat do jednoho z paměťových registrů <guilabel>R0</guilabel> to <guilabel>R9</guilabel>. Paměťové registry můžete zobrazit volbou <menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Paměťové registry</guimenuitem></menuchoice>.

source: The memory registers can be dismissed by either choosing <menuchoice><guimenu>View</guimenu><guimenuitem>Memory Registers</guimenuitem></menuchoice> again, or by clicking on the <guibutton>Close</guibutton> button in the memory register window.
cs: Znovu je skrýt můžete opětovnou volbou menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Paměťové registry</guimenuitem></menuchoice> nebo kliknutím na tlačítko <guibutton>Zavřít</guibutton> v okně paměťových registrů.

source: <xref linkend="gcalctool-TBL-mem-reg"/> describes the memory functions that you can use.
cs: <xref linkend="gcalctool-TBL-mem-reg"/> popisuje paměťové funkce, které můžete používat.

source: Memory Functions
cs: Paměťové funkce

source: Store Value in Memory Register
cs: Uloží hodnotu do paměťového registru

source: Stores the current contents of the display area in the specified memory register. Click <guibutton>Sto</guibutton>, then select a memory register from the popup menu.
cs: Uloží aktuální hodnotu na displeji do určeného paměťového registru. Klikněte na tlačítko <guibutton>Sto</guibutton> a následně zvolte ve vyskakovací nabídce paměťový registr.

source: To clear a memory register during a <application>gcalctool</application> session:
cs: Vymazání paměťového registru během práce v <application>gcalctool</application>:

source: Click <guibutton>Clr</guibutton>.
cs: Kliknout na <guibutton>Clr</guibutton>.

source: Click <guibutton>Sto</guibutton>.
cs: Kliknout na <guibutton>Sto</guibutton>.

source: Select the memory register from the popup menu.
cs: Zvolit paměťový registr z vyskakovací nabídky.

source: The value 22 is stored in memory register <guilabel>R2</guilabel>.
cs: Do paměťového registru <guilabel>R2</guilabel> se uloží hodnota 22.

source: Retrieve Value From Memory Register
cs: Získání hodnoty z paměťového registru

source: Retrieves the contents of the specified memory register. Click <guibutton>Rcl</guibutton>, then select the memory register from the popup menu.
cs: Vytáhne obsah zvoleného paměťového registru. Klikněte na <guibutton>Rcl</guibutton> a z vyskakovací nabídky zvolte paměťový registr.

source: The value in the display area is 22.
cs: Hodnota na displeji je 22.

source: Exchange Memory Register Value and Displayed Value
cs: Prohození hodnotu paměťového registru a displeje

source: Exchanges the contents of the specified memory register and the current value in the display area. Click <guibutton>Exch</guibutton>, then select the memory register from the popup menu.
cs: Zamění mezi sebou obsah zvoleného paměťového registru a aktuální hodnotu na displeji. Klikněte na <guibutton>Exch</guibutton> a z vyskakovací nabídky zvolte paměťový registr.

source: The value in the display area changes from 44 to 22, the value in R2 changes from 22 to 44.
cs: Hodnota na displeji se změní ze 44 na 22 a hodnota v R2 se změní z 22 na 44.

source: If you use keyboard shortcuts, you can use the keyboard to specify the memory register, as shown in the following examples:
cs: Pokud používáte klávesové zkratky, můžete k volbě paměťového registru použít klávesnici tak, jako v následujících příkladech:

source: Keyboard Entry
cs: Vstup z klávesnice

source: Stores the current contents of the display area in memory register <guilabel>R2</guilabel>.
cs: Uloží aktuální obsah displeje do paměťového registru <guilabel>R2</guilabel>.

source: Retrieves the current contents of memory register <guilabel>R2</guilabel> into the display area.
cs: Přenese aktuální hodnotu paměťového registru <guilabel>R2</guilabel> na displej.

source: Exchanges the current value of the display area with the contents of memory register <guilabel>R2</guilabel>.
cs: Zamění aktuální hodnotu na displeji s obsahem paměťového registru <guilabel>R2</guilabel>.

source: To Perform Financial Calculations
cs: Provádění finančních výpočtů

source: To change to Financial mode, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Financial</guimenuitem></menuchoice>.
cs: Do finančního režimu se přepnete volbou menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Finanční</guimenuitem></menuchoice>.

source: When you change to Financial mode, the following buttons are displayed above the Basic and Advanced mode buttons:
cs: Po přepnutí do finančního režimu se nad tlačítky základního a pokročilého režimu zobrazí následující tlačítka:

source: <application>gcalctool</application> Financial Mode Buttons
cs: Tlačítka <application>gcalctool</application> ve finančním režimu

source: Shows <placeholder-1/> Financial mode buttons.
cs: Zobrazuje <placeholder-1/> tlačítka <application>gcalctool</application> ve finančním režimu

source: To perform financial calculations, use the buttons described in <xref linkend="gcalctool-TBL-financial-calc"/>.
cs: K provádění finančních výpočtů použijte tlačítka, která popisuje <xref linkend="gcalctool-TBL-financial-calc"/>.

source: Performing Financial Calculations
cs: Provádění finančních výpočtů

source: Compounding Term
cs: Doba úročení

source: Calculates the number of compounding periods necessary to increase an investment from a present value to a future value, at a fixed interest rate per compounding period.
cs: Vypočítá počet úročených období nutných ke navýšení investice ze současné hodnoty na budoucí hodnotu při fixní úrokové sazbě po celé úročené období.

source: You have just deposited $8000 in an account that pays an annual interest rate of 9%, compounded monthly. Given the annual interest rate, you determine that the simple monthly interest rate is 0.09 / 12 = 0.0075. To calculate the time period necessary to double your investment, click <guibutton>Ctrm</guibutton>, and put the following values into the text entries:
cs: Máte na uloženo 8&nbsp;000,-&nbsp;€ na účtu s úrokem 9% p.a., který vám připisují měsíčně. Daný roční úrok jednoduše znamená, že měsíčně vám připisují 0,09 ÷ 12 = 0,0075. Pokud chcete spočítat, za jak dlouho se vaše úspory zdvojnásobí, klikněte na <guibutton>Ctrm</guibutton> a do textových polí zadejte následující hodnoty:

source: Periodic Interest Rate
cs: Úroková sazba za období

source: Future Value
cs: Budoucí hodnota

source: Present Value
cs: Současná hodnota

source: Click <guibutton>Calculate</guibutton>
cs: Klikněte na <guibutton>Spočítat</guibutton>

source: The investment doubles in value in 92.77 months.
cs: Investice se zdvojnásobí za 92,77 měsíců.

source: Double-Declining Depreciation
cs: Dvojitě degresivní odpis

source: Calculates the depreciation allowance on an asset for a specified period of time, using the double-declining balance method.
cs: Vypočítá zrychlené odpisy dané aktivy za určité období pomocí dvojité degresivní metody odpisu.

source: You have just purchased an office machine for $8000. The useful life of this machine is six years. The salvage value after six years is $900. To calculate the depreciation expense for the fourth year, using the double-declining balance method, click <guibutton>Ddb</guibutton> and put the following values into the text entries:
cs: Právě jste do kanceláře nakoupili stroj za 8&nbsp;000,-&nbsp;€. Životnost stroje je určená na šest let. Zůstatková hodnota po šesti letech je 900,-&nbsp;€. Pro výpočet odpisových nákladů po dobu čtyř let s použitím dvojitě degresivní metody klikněte na <guibutton>Ddb</guibutton> a do textových polí zadejte následující hodnoty:

source: Cost
cs: Náklady

source: Salvage
cs: Zůstatek

source: Life
cs: Životnost

source: Period
cs: Období

source: The depreciation expense for the fourth year is $790.12.
cs: Odpisové náklady po dobu čtyř let jsou 790,12&nbsp;€.

source: Calculates the future value of an investment based on a series of equal payments at a specific periodic interest rate, over the number of payment periods in the term.
cs: Vypočítá budoucí hodnotu investic založenou na sérii stejnoměrných plateb s pravidelnou úrokovou sazbou po zadaný počet platebních období v dané lhůtě.

source: You plan to deposit $4000 in a bank account on the last day of each year for the next 20 years. The account pays 8% interest, compounded annually. Interest is paid on the last day of each year. To calculate the value of your account in 20 years, press <guibutton>Fv</guibutton> and put the following values into the text entries:
cs: Plánujete ukládat na bankovní účet vždy poslední den v roce 4&nbsp;000,-&nbsp;€ po dobu příštích 20&nbsp;let. Banka vám na účtu zaručí úrok 8% p.a. Úrok je vyplácen vždy poslední den v roce. Pro výpočet částky na vašem účtu po 20&nbsp;letech zmáčkněte <guibutton>Fv</guibutton> a do textových polí zadejte následující hodnoty:

source: Periodic Payment
cs: Pravidelná splátka

source: Number Of Periods
cs: Počet období

source: At the end of 20 years, the value of the account is $183,047.86.
cs: Po dvaceti letech bude na účtu částka 183&nbsp;047,86&nbsp;€.

source: Gross Profit Margin
cs: Hrubá marže

source: Calculates the resale price of a product, based on the product cost and the wanted gross profit margin.
cs: Vypočítá prodejní cenu produktu založenou na nákladech a požadované hrubé marži.

source: You sell T-Shirts online. Each T-Shirt cost you $12 in material and labor. You want to sell the T-Shirts with a Gross Profit Margin of 0.40 - for every five dollars you earn, you want two to be profit. To calculate the price you would have to sell your T-Shirts for, press <guibutton>Gpm</guibutton> and put the following values into the text entries:
cs: Prodáváte trička on-line. Náklady na každé tričko jsou 12,-&nbsp;€ za materiál a práci. Chcete trička prodávat s hrubým ziskem 0,40 - z každých pěti euro, které vyděláte, chcete mít dvě euro zisk. K výpočtu ceny, za kterou byste měli tričky prodávat, stiskněte <guibutton>Gpm</guibutton> a vložte následující hodnoty do textových polí:

source: Margin
cs: Marže

source: You will have to sell your T-Shirts for $20
cs: Budete muset prodávat trička za 20,- €.

source: Calculates the amount of the periodic payment of a loan, where payments are made at the end of each payment period.
cs: Spočítá výši pravidelné splátky půjčky, kde jsou platby prováděny na konci každého platebního období.

source: You are considering a $120,000 mortgage for 30 years at an annual interest rate of 11.0%. Given the annual interest rate, you determine that the simple monthly interest rate is 0.11 / 12 = 0.00917. The term is 30 * 12 = 360 months. To calculate the monthly repayment for this mortgage, press <guibutton>Pmt</guibutton> and put the following values into the text entries:
cs: Plánujete hypotéku ve výši 120&nbsp;000,-&nbsp;€ na dobu 30&nbsp;let s roční úrokovou sazbou 11%. Daná roční úroková sazba jednoduše říká, že každý měsíc zaplatíte úrok 0,11 ÷ 12 = 0,00917. Doba splácení je 30 × 12 = 360 měsíců. Pro výpočet měsíčních splátek takovéto hypotéky zmáčkněte <guibutton>Pmt</guibutton> a do textových polí zadejte následující hodnoty:

source: Principal
cs: Půjčka

source: Term
cs: Doba

source: The monthly repayment is $1143.15.
cs: Měsíční splátka je 1&nbsp;143,15&nbsp;€.

source: Calculates the present value of an investment based on a series of equal payments, discounted at a periodic interest rate, over the number of payment periods in the term.
cs: Vypočítá současnou hodnotu investice založené na sérii stejnoměrných plateb sníženou o pravidelnou úrokovou sazbu po zadaný počet platebních období v dané lhůtě.

source: You have just won a million dollars. The prize is awarded in 20 annual payments of $50,000 each. Annual payments are received at the end of each year. If you were to accept the annual payments of $50,000, you would invest the money at a rate of 9%, compounded annually.
cs: Právě jste vyhráli milion euro. Cena je vyplácená v 20 ročních splátkách po 50&nbsp;000,-&nbsp;€. Roční splátky obdržíte vždy na konci roku. Pokud byste přijali splátky po 50&nbsp;000, pak byste je investovali s ročním úrokem 9%.

source: However, you are given the option of receiving a single lump-sum payment of $400,000 instead of the million dollars annuity. To calculate which option is worth more in today's dollars, press <guibutton>Pv</guibutton> and put the following values into the text entries:
cs: Dostali jste ale také možnost nechat si vyplatit jednorázovou částku ve výši 400&nbsp;000,-&nbsp;€ místo miliónu ve splátkách. Pro výpočet, která volba je v současných eurech výhodnější, stiskněte <guibutton>Pv</guibutton> a následně zadejte do textových polí tyto hodnoty:

source: The $1,000,000 paid over 20 years is worth $456,427.28 in present dollars.
cs: 1&nbsp;000&nbsp;000,-&nbsp;€ zaplacených v průběhu 20&nbsp;let má hodnotu 456&nbsp;427,28&nbsp;€ v současných eurech.

source: Calculates the periodic interest necessary to increase an investment of a present value to a future value, over a number of compounding periods.
cs: Vypočítá měsíční úrok nutný k navýšení investice ze současné hodnoty na budoucí hodnotu po zadaný počet úročných období.

source: You have invested $20,000 in a bond. The bond matures in five years, and has a maturity value of $30,000. Interest is compounded monthly. The term is 5 * 12 = 60 months. To calculate the periodic interest rate for this investment, press <guibutton>Rate</guibutton> and put the following values into the text entries:
cs: Investoval jste 20&nbsp;000,-&nbsp;€ do dluhopisů. Dluhopis je splatný po pěti letech a má splatnou hodnotu 30&nbsp;000,-&nbsp;€. Úrok je připočítáván měsíčně. Doba je 5 × 12 = 60 měsíců. Pro výpočet pravidelných úrokových splátek této investice zmáčkněte <guibutton>Rate</guibutton> a následně do textových polí zadejte tyto hodnoty:

source: The monthly interest rate is 0.678%. The annual interest rate is 0.678% * 12 = 8.14%.
cs: Měsíční úroková sazba je 0,678%. Roční úroková sazba je 0,678% × 12 = 8,14%.

source: Straight-Line Depreciation
cs: Lineární odpis

source: Calculates the straight-line depreciation of an asset for one period. The depreciable cost is <replaceable>cost</replaceable> - <replaceable>salvage</replaceable>. The straight-line method of depreciation divides the depreciable cost evenly over the useful life of an asset. The useful life is the number of periods, typically years, over which an asset is depreciated.
cs: Vypočítává lineární odpisy dané aktivy za určité období. Odpisovaná hodnota je daná jako <replaceable>pořizovací náklady</replaceable> - <replaceable>zůstatková hodnota</replaceable>. Lineární metoda odpisu dělí odepisovanou hodnotu rovnoměrně po celou použitelnou životnost aktiva. Použitelná životnost je počet období, typicky let, po kterou je aktivum odepisováno.

source: You have just purchased an office machine for $8000. The useful life of this machine is six years. The salvage value after six years is $900. To calculate the yearly depreciation expense, using the straight-line method, prss <guibutton>Sln</guibutton>, and put the following values into the first three memory registers:
cs: Právě jste do kanceláře nakoupili stroj za 8&nbsp;000,-&nbsp;€. Životnost stroje je určená na šest let. Zůstatková hodnota po šesti letech je 900,-&nbsp;€. Pro výpočet ročních odpisových nákladů s použitím lineární metody zmáčkněte <guibutton>Sln</guibutton> a do textových polí následující tři hodnoty:

source: The yearly depreciation expense is $1183.33.
cs: Roční odpisové náklady jsou 1&nbsp;183,33&nbsp;€.

source: Sum-Of-The-Years'-Digits Depreciation
cs: Hodnota degresivního odpisu pro období

source: Calculates the depreciation allowance on an asset for a specified period of time, using the Sum-Of-The-Years'-Digits method. This method of depreciation accelerates the rate of depreciation, so that more depreciation expense occurs in earlier periods than in later ones. The depreciable cost is <replaceable>cost</replaceable> - <replaceable>salvage</replaceable>. The useful life is the number of periods, typically years, over which an asset is depreciated.
cs: Vypočítá hodnota degresivního odpisu pro zadané období s použitím metody SYD (Sum of The Years' Digits). Jedná se o degresivní metodu odpisů, takže z počátku je hodnota odpisů vyšší a časem klesá. Odepisovaná hodnota je daná jako <replaceable>náklady</replaceable> - <replaceable>zůstatková cena</replaceable>. Životnost je počet období, typicky v letech, po které je majetek odepisován.

source: You have just purchased an office machine for $8000. The useful life of this machine is six years. The salvage value after six years is $900. To calculate the depreciation expense for the fourth year, using the sum-of-the-years'-digits method, press <guibutton>Syd</guibutton>, and put the following values into the text entries:
cs: Právě jste do kanceláře koupili stroj za 8&nbsp;000,-€ Životnost tohoto stroje je šest let. Zůstatková hodnota po šesti letech je 900,-&nbsp;€. Pro výpočet degresivní hodnoty odpisu pro čtvrtý roku zmáčkněte <guibutton>Syd</guibutton> a následně do textových polí zadejte tyto hodnoty:

source: The depreciation expense for the fourth year is $1014.29.
cs: Odpisové náklady pro čtyři roky jsou 1&nbsp;014,29&nbsp;€

source: Payment Period
cs: Platební období

source: Calculates the number of payment periods that are necessary during the term of an ordinary annuity, to accumulate a future value, at a certain periodic interest rate.
cs: Vypočítá počet platebních období nutných při pravidelných platbách k získání budoucí hodnoty za dané pravidelné úrokové sazby.

source: You plan to deposit $1800 in a bank account on the last day of each year. The account pays 11% interest, compounded annually. Interest is paid on the last day of each year. To calculate the time period necessary to accumulate $120,000, press <guibutton>Term</guibutton>, and put the following values into the text entries:
cs: Plánujete ukládat do banky na účet 1&nbsp;800,-&nbsp;€ pravidelně vždy poslední den v roce. Na účtu je vyplácený úrok 11% p.a. Úrok je vyplácen vždy poslední den v roce. Pro výpočet počtu období nutných k tomu, abyste nastřádali 120&nbsp;000,-&nbsp;€, zmáčkněte <guibutton>Term</guibutton> a potom do textových polí zadejte následující hodnoty:

source: $120,000 accumulates in the account in 20.32 years.
cs: 120&nbsp;000,-&nbsp;€ na účtu nastřádáte za 20,32&nbsp;roku.

source: To Perform Scientific Calculations
cs: Provádění vědeckých výpočtů

source: To change to Scientific mode, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Scientific</guimenuitem></menuchoice>.
cs: Do vědeckého režimu se přepnete volbou <menuchoice><guimenu>Zobrazit</guimenu><guimenuitem>Vědecká</guimenuitem></menuchoice>.

source: When you change to Scientific mode, the following buttons are displayed above the Basic and Advanced mode buttons:
cs: Po přepnutí do vědeckého režimu se na tlačítky základního a pokročilého režimu zobrazí ještě následující tlačítka:

source: <application>gcalctool</application> Scientific Mode Buttons
cs: Tlačítka <application>gcalctool</application> ve vědeckém režimu

source: Shows <placeholder-1/> Scientific mode buttons.
cs: Zobrazuje <placeholder-1/> tlačítka <application>gcalctool</application> ve vědeckém režimu

source: To Set the Accuracy
cs: Nastavení přesnosti

source: To set the accuracy of the display area and of the memory registers, click <guibutton>Acc</guibutton>, then select from the popup menu the accuracy level that you require. The current accuracy level is indicated by a preceding black circle in the popup menu. Up to 99 significant places can be displayed. The default accuracy is 9 significant places.
cs: Přesnost displeje a paměťových registrů nastavíte tak, že kliknete na <guibutton>Acc</guibutton> a ve vyskakovací nabídce zvolíte úroveň přesnosti, kterou požadujete. Aktuální úroveň přesnosti poznáte podle vyplněného kolečka před ní. Zobrazovat lze až 99 významných míst. Výchozí přesnost je 9 významných míst.

source: To set the accuracy level above 9, select <guilabel>Other (9) ...</guilabel>, then choose the accuracy level you require in the <guilabel>Set Precision</guilabel> popup.
cs: Pokud chcete nastavit větší přesnost než 9, musíte zvolit <guilabel>Jiná (9) ...</guilabel>, a v dialogu <guilabel>Nastavení přesnosti</guilabel> zvolit požadovanou úroveň.
