Repository: GNOME/gnome-calculator
Catalog: po/*.po
Languages: hy, uz

source: Weeks
uz: Haftalar

# unit-symbols
source: week,weeks
uz: hafta,haftalar

source: Days
uz: Kunlar

# unit-symbols
source: day,days
uz: kun,kunlar

source: Hours
uz: Soat

# unit-symbols
source: hour,hours
uz: soat,soatlar

source: Minutes
uz: Daqiqalar

# unit-symbols
source: minute,minutes
uz: daqiqa,daqiqa

source: Seconds
uz: Soniyalar

# unit-symbols
source: second,seconds,s
uz: soniya, soniya,s

source: Milliseconds
uz: Millisekund

# unit-symbols
source: millisecond,milliseconds,ms
uz: millisekund,millisekund,ms

source: Microseconds
uz: Mikrosekund

# unit-symbols
source: microsecond,microseconds,us,μs
uz: mikrosekund,mikrosekund,us,μs

source: Nanoseconds
uz: Nanosekundlar

# unit-symbols
source: nanosecond,nanoseconds,ns
uz: nanosekund,nanosekund,ns

source: Celsius
uz: Selsiy

source: Fahrenheit
uz: Farengeyt

source: Bits
uz: Boʻlaklar

# unit-symbols
source: bit,bits,b
uz: bit,bitlar,b

source: Bytes
uz: Baytlar

# unit-symbols
source: byte,bytes,B
uz: bayt,bayt,B

source: Kilobits
uz: Kilobit

source: Kilobytes
uz: Kilobayt

# unit-symbols
source: kilobyte,kilobytes,kB,KB
uz: kilobayt,kilobayt,kB,KB

source: Kibibits
uz: Kibibitlar

source: Kibibytes
uz: Kibibaytlar

# unit-symbols
source: kibibyte,kibibytes,KiB
uz: kibibayt,kibibayt,KiB

source: Megabits
uz: Megabit

# unit-symbols
source: megabit,megabits,Mb
uz: megabit, megabit, Mb

source: Megabytes
uz: Megabayt

# unit-symbols
source: megabyte,megabytes,MB
uz: megabayt, megabayt, MB

source: Mebibits
uz: Mebibitlar

# unit-symbols
source: mebibit,mebibits,Mib
uz: mebibit,mebibitlar,Mib

source: Mebibytes
uz: Mebibitlar

# unit-symbols
source: mebibyte,mebibytes,MiB
uz: mebibayt,mebibayt,MiB

source: Gigabits
uz: Gigabitlar

# unit-symbols
source: gigabit,gigabits,Gb
uz: gigabit,gigabit,Gb

source: Gigabytes
uz: Gigabayt

# unit-symbols
source: gigabyte,gigabytes,GB
uz: gigabayt,gigabayt,GB

source: Gibibits
uz: Gibibitlar

# unit-symbols
source: gibibit,gibibits,Gib
uz: gibbit,gibibits,Gib

source: Gibibytes
uz: Gibibaytlar

# unit-symbols
source: gibibyte,gibibytes,GiB
uz: gibibayt,gibibayt,GiB

source: Terabits
uz: Terabitlar

# unit-symbols
source: terabit,terabits,Tb
uz: terabit, terabit,Tb

source: Terabytes
uz: Terabaytlar

# unit-symbols
source: terabyte,terabytes,TB
uz: terabayt,terabayt,TB

source: Tebibits
uz: Tebibitslar

source: Tebibytes
uz: Tebibitlar

# unit-symbols
source: tebibyte,tebibytes,TiB
uz: tebibayt,tebibayt,TiB

source: Petabits
uz: Petabitslar

source: Petabytes
uz: Petabayt

# unit-symbols
source: petabyte,petabytes,PB
uz: petabayt,petabayt,PB

source: Pebibits
uz: Pebibitlar

# unit-symbols
source: pebibit,pebibits,Pib
uz: pebibit,pebibitlar,Pib

source: Pebibytes
uz: Pebibitlar

# unit-symbols
source: pebibyte,pebibytes,PiB
uz: pebibayt,pebibayt,PiB

source: Exabits
uz: Ekzabitlar

# unit-symbols
source: exabit,exabits,Eb
uz: eksabit,eksabits,Eb

source: Exabytes
uz: Eksabaytlar

# unit-symbols
source: exabyte,exabytes,EB
uz: ekzabayt,ekzabayt,EB

source: Exbibits
uz: Eksbibitlar

# unit-symbols
source: exbibit,exbibits,Eib
uz: eksbibit,eksbibitlar,Eib

source: Exbibytes
uz: Eksbibitlar

# unit-symbols
source: exbibyte,exbibytes,EiB
uz: eksbibayt,eksbibayt,EiB

source: Zettabits
uz: Zettabitlar

# unit-symbols
source: zettabit,zettabits,Zb
uz: zettabit,zettabit,Zb

source: Zettabytes
uz: Zettabaytlar

# unit-symbols
source: zettabyte,zettabytes,ZB
uz: zettabayt, zettabayt,ZB

source: Zebibits
uz: Zebibitlar

# unit-symbols
source: zebibit,zebibits,Zib
uz: zebibit,zebibitlar,Zib

source: Zebibytes
uz: Zebibaytlar

# unit-symbols
source: zebibyte,zebibytes,ZiB
uz: zebibayt,zebibayt,ZiB

source: Yottabits
uz: Yottabitlar

source: Yottabytes
uz: Yottabayt

# unit-symbols
source: yottabyte,yottabytes,YB
uz: yottabayt,yottabayt,YB

source: Yobibits
uz: Yobibitlar

source: Yobibytes
uz: Yobibaytlar

# unit-symbols
source: yobibyte,yobibytes,YiB
uz: yobibayt,yobibayt,YiB

source: Hertz
uz: Gers

# unit-symbols
source: hertz,Hz
uz: gerts,Hz

source: Kilohertz
uz: Kilogerts

# unit-symbols
source: kilohertz,kHz
uz: kilogers,kGs

source: Megahertz
uz: Megagerts

# unit-symbols
source: megahertz,MHz
uz: megagerts,MHz

source: Gigahertz
uz: Gigagerts

# unit-symbols
source: gigahertz,GHz
uz: gigagerts,GHz

source: Joules
uz: Joul

# unit-symbols
source: Joule,J,joule,joules
uz: Joul,J,joul,joul

source: Kilojoules
uz: Kilojoullar

# unit-symbols
source: KJ,kilojoules,kilojoule
uz: KJ,kilojoul,kilojoul

source: Megajoules
uz: Megajoullar

# unit-symbols
source: MJ,megajoules,megajoule
uz: MJ,megajoul,megajoul

source: Kilowatt-Hours
uz: Kilovatt-soat

# unit-symbols
source: kwh,kWh,kilowatt-hour,kilowatthour
uz: kVt/soat, kVt/soat, kVt/soat

source: British Thermal Units
uz: Britaniya issiqlik qurilmalari

source: Calories
uz: Kaloriya

# unit-symbols
source: calories,calorie,cal
uz: kaloriya,kaloriya,kal

source: Kilocalories
uz: Kilokaloriya

# unit-symbols
source: kilocalories,kilocalorie,kcal
uz: kilokaloriya,kilokaloriya,kkal

source: Ergs
uz: Erglar

# unit-symbols
source: ergs,erg
uz: erg,erg

source: Electron Volts
uz: Elektron voltlar

# unit-symbols
source: electronvolt,electronvolts,ev
uz: elektronvolt,elektronvolt,ev

source: Foot-Pounds
uz: Fut-Funtlar

# unit-symbols
source: foot-pound,foot-pounds,ft-lb,ft-lbs
uz: fut-funt,fut-funt,fut-funt,fut-funt

source: Pascals
uz: Paskal

# unit-symbols
source: Pascal,pascal,Pa
uz: Paskal,paskal,Pa

source: Kilopascals
uz: Kilopaskallar

# unit-symbols
source: Kilopascal,kilopascal,kPa
uz: Kilopaskal,kilopaskal,kPa

source: Hectopascals
uz: Gektopaskallar

# unit-symbols
source: Hectopascal,hectopascal,hPa
uz: Gektopaskal, gektopaskal, gPa

source: Bars
uz: Barlar

source: Standard Atmospheres
uz: Standart atmosferalar

# unit-symbols
source: Standard Atmosphere,Standard atmosphere,standard atmosphere,Atm,atm
uz: Standart atmosfera,Standart atmosfera,standart atmosfera,Atm,atm

source: Millimeters of Mercury
uz: Merkuriy millimetrlari

# unit-symbols
source: Millimeter of Mercury,millimeter of mercury,mmHg
uz: Millimetr simob, millimetr simob, mm simob ustuni

source: Inches of Mercury
uz: Merkuriy duymlari

# unit-symbols
source: Inch of Mercury,inch of mercury,inHg
uz: Duym simob, duym simob, inHg

source: Pounds per Square Inch
uz: Kvadrat dyuymga funt

# unit-symbols
source: Pound per Square Inch,pound per square inch,psi
uz: Kvadrat dyuymga funt,kvadrat dyuymga funt,psi

source: Currency
uz: Valyuta

source: Number Base
uz: Sonlar asosiy tizimi

source: Binary
hy: Երկուական
uz: Ikkilik

source: Octal
hy: Ութական
uz: Sakkizlik

source: Decimal
hy: Տասնորդական
uz: Oʻnlik

source: Hexadecimal
hy: Տասնվեցական
uz: Oʻn oltitalik

source: Open in Calculator
uz: Kalkulyatorda ochish

source: Result copied
uz: Natija nusxalandi

source: Result was copied successfully
uz: Natija muvaffaqiyatli nusxalandi

source: Degrees
uz: Darajalar

source: Angle Unit: %s
uz: Burchak birligi: %s

source: Not Available
uz: Mavjud emas

source: Start in given mode (basic, advanced, financial, programming, keyboard, conversion)
uz: Koʻrsatilgan rejimda boshlash (asosiy, qoʻshimcha, moliya, dasturlash, klaviatura, konvertatsiya)

source: Solve given equation
uz: Berilgan tenglamani yeching

source: Start with given equation
uz: Berilgan tenglama bilan boshlash

source: Show release version
uz: Chiqarish versiyasini koʻrsatish

source: © 1986–%d The Calculator authors
uz: © 1986–%d Kalkulator mualliflari

source: translator-credits
uz: bemeritus <bemerituss@gmail.com> Baxrom Raxmatov

source: Exchange Rate Data Providers
uz: Valyuta kursi ma'lumotlari provayderlari

source: Exchange rates data by %s
uz: Valyuta kurslari ma'lumoti %s tomonidan

source: Close All?
uz: Hammasini yopish?

source: Are you sure you want to close all open windows?
uz: Barcha ochilgan oynalarni yopishni istaysizmi?

source: _Cancel
uz: Bekor qilish

source: Close _All
uz: Hammasini yopish

source: Error
uz: Xatolik

source: Defined Functions
uz: Aniqlangan funksiyalar

source: Built-in Keywords
uz: Ichki kalit soʻzlar

source: Defined Currencies
uz: Aniqlangan valyutalar

source: Defined Variables
uz: Aniqlangan oʻzgaruvchilar

source: Can not use defined variable or constant names
uz: Aniqlangan oʻzgaruvchi yoki konstantalar nomlaridan foydalanish mumkin emas

source: Can not use built-in function or operator names
uz: Ichki funksiya yoki operator nomlaridan foydalanish mumkin emas

source: Function name can not start with a digit
uz: Funksiya nomi raqam bilan boshlanishi mumkin emas

source: Function name can only contain digits, letters and underscores
uz: Funksiya nomi faqat raqamlar, harflar va pastki chiziqlardan iborat boʻlishi mumkin

source: Edit
uz: Tahrirlash

source: Delete
hy: Ջնջել
uz: Oʻchirish

source: Never
uz: Hech qachon

source: Daily
uz: Kunlik

source: Weekly
uz: Haftalik

source: Currency Code
uz: Valyuta kodi

source: Currency Name
uz: Valyuta nomi

source: Both
uz: Ikkalasi ham

source: Can not use defined function or operator names
uz: Aniqlangan funksiya yoki operator nomlaridan foydalanish mumkin emas

source: Can not use built-in variable or constant names
uz: Ichki oʻzgaruvchi yoki konstantalar nomlaridan foydalanish mumkin emas

source: Variable name can not start with a digit
uz: Oʻzgaruvchi nomi raqam bilan boshlanishi mumkin emas

source: Variable name can only contain digits, letters and underscores
uz: Oʻzgaruvchi nomi faqat raqamlar, harflar va pastki chiziqlardan iborat boʻlishi mumkin

source: Basic
uz: Asosiy

source: Advanced
uz: Qoʻshimcha

source: Financial
uz: Moliya

source: Keyboard
uz: Klaviatura

source: Conversion
uz: Konvertatsiya

source: Clear Display [Escape]
uz: Ekranni tozalash [Escape]

source: Superscript Mode [Ctrl]
uz: Yuqori indeks rejimi [Ctrl]

source: Subscript Mode [Alt]
uz: Pastki indeks rejimi [Alt]

source: Variables and Constants
uz: Oʻzgaruvchilar va konstantalar

source: Additional Functions
uz: Qoʻshimcha funksiyalar

source: Divide [/]
uz: Boʻlish [/]

source: Multiply [*]
uz: Koʻpaytirish [*]

source: Subtract [-]
uz: Ayirish [-]

source: Add [+]
uz: Qoʻshish [+]

source: Percentage [%]
uz: Foiz [%]

source: Group [()]
uz: Guruhlash [()]

source: Calculate Result
uz: Natijani hisoblash

source: Inverse Modifier [Shift]
uz: Teskari modifikator [Shift]

source: Square [Ctrl+2]
uz: Kvadrat [Ctrl+2]

source: Square Root [Ctrl+R]
uz: Kvadrat ildiz [Ctrl+R]

source: Exponent [^ or **]
uz: Daraja [^ yoki **]

source: Nth Root
uz: N-chi ildiz

source: Common Logarithm
uz: Oddiy logarifm

source: Base-10 Exponential
uz: 10-asosli eksponensial

source: Natural Exponential
uz: Tabiiy eksponensial

source: Inverse [Ctrl+I]
uz: Teskari [Ctrl+I]

source: Round [[]]
uz: Yaxlitlash [[]]

source: Absolute Value [||]
uz: Absolyut qiymat [||]

source: Factorial [!]
uz: Faktorial [!]

source: Imaginary Unit
uz: Xayoliy birlik

source: Factorize [Ctrl+F]
uz: Koeffitsientlar [Ctrl+F]

source: Switch Conversion Units
uz: Konvertatsiya birliklarini almashtirish

source: Backspace
hy: Մաքրել
uz: Orqaga

source: Degrees, Minutes, Seconds
uz: Daraja, daqiqa, soniya

source: Change Sign
uz: Ishorani oʻzgartirish

source: Exchange Rate Details
uz: Valyuta kursi tafsilotlari

source: Updated
uz: Yangilangan

source: Source
uz: Manba

source: _Refresh Rates
uz: Kurslarni yangilash

source: Compounding Term
uz: Muddatli kapitallashuv

source: Double Declining Depreciation
uz: Ikki baravar kamayuvchi balans usuli

source: Fv
uz: Kq

source: Future Value
uz: Kelajakdagi qiymat

source: Gpm
uz: Yfm

source: Gross Profit Margin
uz: Yalpi foyda marjasi

source: Pmt
uz: Dt

source: Periodic Payment
uz: Davriy toʻlov

source: Pv
uz: Jq

source: Present Value
uz: Joriy qiymat

source: Rate
uz: Stavka

source: Periodic Interest Rate
uz: Davriy foiz stavkasi

source: Sln
uz: Cha

source: Straight Line Depreciation
uz: Chiziqli amortizatsiya

source: Syd
uz: Yrya

source: Sum of the Years Digits Depreciation
uz: Yillar raqamlari yigʻindisi amortizatsiyasi

source: Term
uz: Muddat

source: Financial Term
uz: Moliya muddati

source: Currency Conversion
uz: Valyuta konvertatsiyasi

source: C_alculate
uz: Hisoblash

source: Calculates the number of compounding periods necessary to increase an investment of present value to a future value, at a fixed interest rate per compounding period.
uz: Joriy qiymatdan kelajakdagi qiymatga oʻtish uchun zarur boʻlgan kapitallashuv davrlari sonini, har bir kapitallashuv davri uchun belgilangan foiz stavkasida hisoblaydi.

source: Double-Declining Depreciation
uz: Ikki baravar kamayuvchi amortizatsiya

source: Calculates the depreciation allowance on an asset for a specified period of time, using the double-declining balance method.
uz: Aktivning ma'lum bir davr uchun amortizatsiya ajratmasini, ikki baravar kamayuvchi balans usuli yordamida hisoblaydi.

source: Cost
uz: Narx

source: Life
uz: Xizmat muddati

source: Period
uz: Davr

source: Calculates the future value of an investment based on a series of equal payments at a periodic interest rate over the number of payment periods in the term.
uz: Sarmoyaning kelajakdagi qiymatini, teng toʻlovlar seriyasi asosida, muddat davomidagi toʻlov davrlari soni boʻyicha davriy foiz stavkasida hisoblaydi.

source: Number of Periods
uz: Davrlar soni

source: Calculates the resale price of a product, based on the product cost and the wanted gross profit margin.
uz: Mahsulotning qayta sotish narxini, mahsulot narxi va istalgan yalpi foyda marjasi asosida hisoblaydi.

source: Calculates the amount of the periodic payment of a loan, where payments are made at the end of each payment period.
uz: Kreditning davriy toʻlov miqdorini hisoblaydi, bu yerda toʻlovlar har bir toʻlov davri oxirida amalga oshiriladi.

source: Calculates the present value of an investment based on a series of equal payments discounted at a periodic interest rate over the number of payment periods in the term.
uz: Sarmoyaning joriy qiymatini, teng toʻlovlar seriyasi asosida, muddat davomidagi toʻlov davrlari soni boʻyicha chegirmalangan davriy foiz stavkasida hisoblaydi.

source: Calculates the periodic interest necessary to increase an investment to a future value, over the number of compounding periods.
uz: Sarmoyani kelajakdagi qiymatga oshirish uchun zarur boʻlgan davriy foiz stavkasini, kapitallashuv davrlari soni boʻyicha hisoblaydi.

source: Straight-Line Depreciation
uz: Chiziqli amortizatsiya

source: Calculates the straight-line depreciation of an asset for one period. The straight-line method of depreciation divides the depreciable cost evenly over the useful life of an asset. The useful life is the number of periods, typically years, over which an asset is depreciated.
uz: Aktivning bir davr uchun chiziqli amortizatsiyasini hisoblaydi. Chiziqli amortizatsiya usuli amortizatsiyalanadigan narxni aktivning foydali xizmat muddati davomida teng taqsimlaydi. Foydali xizmat muddati - bu aktiv amortizatsiyalanadigan davrlar soni, odatda yillar.

source: Salvage
uz: Qutqarish qiymati

source: Sum-of-the-Years’-Digits Depreciation
uz: Yillar raqamlari yigʻindisi amortizatsiyasi

source: Calculates the depreciation allowance on an asset for a specified period of time, using the Sum-of-the-Years’-Digits method. This method of depreciation accelerates the rate of depreciation, so that more depreciation expense occurs in earlier periods than in later ones. The useful life is the number of periods, typically years, over which an asset is depreciated.
uz: Aktivning ma'lum bir davr uchun amortizatsiya ajratmasini, Yillar raqamlari yigʻindisi usuli yordamida hisoblaydi. Ushbu amortizatsiya usuli amortizatsiya tezligini tezlashtiradi, shuning uchun oldingi davrlarda keyingi davrlarga qaraganda koʻproq amortizatsiya xarajatlari yuzaga keladi. Foydali xizmat muddati - bu aktiv amortizatsiyalanadigan davrlar soni, odatda yillar.

source: Payment Period
uz: Toʻlov davri

source: Calculates the number of payment periods that are necessary during the term of an ordinary annuity, to accumulate a future value, at a periodic interest rate.
uz: Oddiy annuitet muddati davomida kelajakdagi qiymatni toʻplash uchun zarur boʻlgan toʻlov davrlari sonini, davriy foiz stavkasida hisoblaydi.

source: Bitwise AND
uz: Bitli AND

source: Bitwise NAND
uz: Bitli NAND

source: Bitwise OR
uz: Bitli OR

source: Bitwise NOR
uz: Bitli NOR

source: Bitwise NOT
uz: Bitli NOT

source: Bitwise Exclusive OR
uz: Bitli Exclusive OR

source: Bitwise Exclusive NOR
uz: Bitli Exclusive NOR

source: Left Shift [<<]
uz: Chap siljish [<<]

source: Right Shift [>>]
uz: Oʻng siljish [>>]

source: Unsigned Right Shift [>>>]
uz: Imzosiz oʻng siljish [>>>]

source: Binary Logarithm
uz: Binary logarifm

source: Base-2 Exponential
uz: 2-asosli eksponensial

source: Ceiling [Ctrl+[]]
uz: Shift [Ctrl+[]]

source: Floor [Alt+[]]
uz: Qavat [Alt+[]]

source: Change Base
uz: Asosni oʻzgartirish

source: Change Word Size
uz: Soʻz hajmini oʻzgartirish

source: Insert Character Code
uz: Belgi kodini kiritish

source: Character
uz: Belgi

source: Convert to
uz: Oʻzgartirish

source: Unicode Code Point
uz: Unicode kod nuqtasi

source: UTF-8 Encoding
uz: UTF-8 kodlash

source: UTF-16 Encoding
uz: UTF-16 kodlash

source: _Insert
uz: Kiritish

source: Exchange Rates Not Loaded
uz: Valyuta kurslari yuklanmadi

source: <a href="r:///">Refresh rates</a> or change refresh interval in preferences
uz: <a href="r:///">Kurslarni yangilang</a> yoki yangilash oraligʻini afzalliklarda oʻzgartiring

source: _Copy
uz: Nusxa olish

source: _Paste
uz: Qoʻyish

source: Function name
uz: Funksiya nomi

source: Select no. of arguments
uz: Argumentlar sonini tanlang

source: Add function
uz: Funksiya qoʻshish

source: Favorite Currencies
uz: Sevimli valyutalar

source: Search currencies
uz: Valyutalarni qidirish

source: No Results Found
uz: Hech qanday natija topilmadi

source: Try a different search
uz: Boshqa qidiruvni sinab koʻring

source: General
hy: Գլխավոր
uz: Umumiy

source: Number of _Decimals
uz: Oʻnlik kasrlar soni

source: Trailing _Zeroes
uz: Orqadagi nollar

source: _Thousands Separators
uz: Minglab ajratgichlar

source: _Angle Units
uz: Burchak birliklari

source: _Word Size
uz: Soʻz hajmi

source: E_xchange Rate Refresh Interval
uz: Valyuta kursini yangilash oraligʻi

source: _Currency Display
uz: Valyutani koʻrsatish

source: _Show Currencies in Auto-Completion List
uz: Avtomatik kiritish roʻyxatida valyutalarni koʻrsatish

source: All
uz: Barchasi

source: Favorite Only
uz: Faqat sevimlilar

source: None
uz: Hech biri

source: _Favorite Currencies
uz: Sevimli valyutalar

# shortcuts dialog
source: General
uz: Umumiy

# shortcuts dialog
source: Open a New Window
uz: Yangi oyna ochish

# shortcuts dialog
source: Close Current Window
uz: Joriy oynani yopish

# shortcuts dialog
source: Quit the Application
uz: Ilovadan chiqish

# shortcuts dialog
source: Show Help
uz: Yordam koʻrsatish

# shortcuts dialog
source: Open Menu
uz: Menyuni ochish

# shortcuts dialog
source: Show Preferences
uz: Afzalliklarni koʻrsatish

# shortcuts dialog
source: Keyboard Shortcuts
uz: Klaviatura yorliqlari

# shortcuts dialog
source: Clear History
uz: Tarixni tozalash

# shortcuts dialog
source: Switching Modes
uz: Rejimlarni almashtirish

# shortcuts dialog
source: Switch to Basic Mode
uz: Asosiy rejimga oʻtish

# shortcuts dialog
source: Switch to Advanced Mode
uz: Qoʻshimcha rejimga oʻtish

# shortcuts dialog
source: Switch to Financial Mode
uz: Moliya rejimiga oʻtish

# shortcuts dialog
source: Switch to Programming Mode
uz: Dasturlash rejimiga oʻtish

# shortcuts dialog
source: Switch to Keyboard Mode
uz: Klaviatura rejimiga almashtirish

# shortcuts dialog
source: Switch to Keyboard Mode (alt.)
uz: Klaviatura rejimiga almashtirish (alt.)

# shortcuts dialog
source: Switch to Conversion Mode
uz: Konversiya rejimiga almashtirish

# shortcuts dialog
source: Programming Mode
uz: Dasturlash rejimi

# shortcuts dialog
source: Switch to Binary
uz: Binarga almashtirish

# shortcuts dialog
source: Switch to Octal
uz: Sakkizlikka almashtirish

# shortcuts dialog
source: Switch to Decimal
uz: Oʻnli kasrga almashtirish

# shortcuts dialog
source: Switch to Hexadecimal
uz: Oʻn oltilik sanoq tizimiga oʻtish

# shortcuts dialog
source: Keyboard Entry
uz: Klaviatura yozuvi

# shortcuts dialog
source: Multiply (×)
uz: Koʻpaytirish (×)

# shortcuts dialog
source: Divide (÷)
uz: Boʻlish (÷)

# shortcuts dialog
source: Square (²)
uz: Kvadrat (²)

# shortcuts dialog
source: Square Root (√)
uz: Kvadrat ildiz (√)

# shortcuts dialog
source: Inverse (⁻¹)
uz: Teskari (⁻¹)

# shortcuts dialog
source: Degree (°)
uz: Daraja (°)

# shortcuts dialog
source: Enter Numbers in Scientific Format
uz: Raqamlarni ilmiy formatda kiriting

# shortcuts dialog
source: Enter Subscript Numbers
uz: Obuna raqamlarini kiriting

# shortcuts dialog
source: Enter Superscript Numbers
uz: Yuqori indeks raqamlarini kiriting

# shortcuts dialog
source: Enter Superscript Minus Sign
uz: Tagyozuv manfiy belgisini kiriting

# shortcuts dialog
source: Equation
uz: Tenglama

# shortcuts dialog
source: Copy
uz: Nusxalash

# shortcuts dialog
source: Paste
uz: Qoʻyish

# shortcuts dialog
source: Undo
uz: Bekor qilish

# shortcuts dialog
source: Redo
uz: Qayta qiling

# shortcuts dialog
source: Previous Equation
uz: Oldingi tenglama

# shortcuts dialog
source: Next Equation
uz: Keyingi tenglama

# shortcuts dialog
source: Clear Display
uz: Ekranni tozalash

# shortcuts dialog
source: Factorize
uz: Koeffitsientlar

source: Constants
hy: Հաստատուններ
uz: Konstantalar

source: Variable name
uz: Oʻzgaruvchi nomi

source: Store value into existing or new variable
uz: Qiymatni mavjud yoki yangi oʻzgaruvchiga saqlash

source: _Basic
uz: Asosiy

source: _Advanced
uz: Qoʻshimcha

source: _Financial
uz: Moliya

source: _Programming
uz: Dasturlash

source: _Keyboard
uz: Klaviatura

source: _Conversion
uz: Konvertatsiya

source: _New Window
uz: Yangi oyna

source: _Clear History
uz: Tarixni tozalash

source: Result Format
uz: Natija formati

source: _Automatic
uz: Avtomatik

source: _Fixed
uz: Aniq

source: _Scientific
uz: Ilmiy

source: _Engineering
uz: Muhandislik

source: _Preferences
uz: Afzalliklar

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _Help
hy: _Օգնություն
uz: Yordam

source: A_bout Calculator
uz: Kalkulator haqida

source: Mode Selection
uz: Rejim tanlash

source: Undo
uz: Bekor qilish

source: Redo
uz: Qayta qiling

source: Main Menu
uz: Asosiy Menyu

source: save here
hy: պահել այստեղ

source: %s v%s, (c) 2002-2014 Simon Flöry Usage: %s [options] options: (GTK options) -h, --help Show this usage message -v, --version Show version information Compiled against GTK version %i.%i.%i Linked against GTK version %i.%i.%i %s-precision floating point numbers.
hy: %s v%s, (c) 2002-2014 Սայմոն Ֆլորի Կիրառություն՝ %s [options] options: (GTK options) -h, --help Ցուցադրել կիրառության հաղորդագրությունը -v, --version Ցուցադրել տարբերակի տվյալները Կազմվել է հետևյալ GTK տարբերակի հետ՝ %i.%i.%i Կապված է հետևյալ GTK տարբերակի հետ՝ %i.%i.%i %s-ճշտված կոտորակային կետով թվերը։

source: [%s] configuration file: Failed to create directory %s.
hy: [%s] կարգաբերման նիշքին չհաջողվեց ստեղծել %s պանակ։

source: [%s] configuration file: We will move the configuration file from %s to %s. After you quit %s, you may remove the configuration file from its old location %s.
hy: [%s] կարգաբերման նիշք։ Նիշքը կտեղափոխվի %s֊ից դեպի %s։ %s֊ն փակելուց հետո, կարող եք հեռացնել կարգաբերման նիշքը %s պանակից։

source: Please submit a bugreport.
hy: Խնդրում ենք հաստատել զեկուցումը սխալի մասին։

source: [%s] %c - unknown operation character. %s
hy: [%s] %c - անհայտ գործողության նիշ։ %s
