Repository: GNOME/gnome-calculator
Catalog: po/*.po
Languages: hy, uz

source: [%s] Conversion of floating point number in float2string failed because buffer was too small. %s )
hy: [%s] Կոտորակային թվի փոխակերպումը տողի ձախողվեց, քանի որ բուֆերային տարածքը շատ փոքր է։ %s )

source: [%s] Conversion of floating point number in float2stringP failed because buffer was too small. %s )
hy: [%s] Կոտորակային թվի փոխակերպումը P տողի ձախողվեց, քանի որ բուֆերային տարածքը շատ փոքր է։ %s )

source: pi
hy: π

source: Euler's Number
hy: Էյլերի թիվը

source: [%s] configuration file: ignoring unknown entry %s=%s. %s
hy: [%s] Կարգաբերման նիշքն անտեսում է անհայտ %s=%s մուտքը։ %s

source: [%s] configuration file: %s has to be TRUE or FALSE. Using defaults. %s
hy: [%s] կարգավորման նիշք: %s ֊ն պետք է լինի ՃԻՇՏ կամ ՍԽԱԼ.։ Օգտագործում է լռելայն տարբերակը։ %s

source: [%s] configuration file: failed to convert %s to a number properly. Have you changed your locales? %s
hy: [%s] կարգավորման նիշք: չհաջողվեց փոխակերպել %s֊ն ուղիղ թվի. Փոխե՞լ եք Ձեր տեղանքը։ %s

source: [%s] configuration file: ignoring unknown key_type in config structure. %s
hy: [%s] կարգաբերման նիշք: Անտեսում է անհայտ key_type կարգավորման կառուցվածքում։ %s

source: [%s] found unknown section %s in configuration file %s. Using preceding section.
hy: [%s] գտնվել է անհայտ %s բաժին %s կարգաբերման նիշքում։ Օգտագործել նախորդ բաժինը։

source: [%s] configuration file: couldn't open configuration file %s for reading. Nothing to worry about if you are starting %s for the first time. Using defaults.
hy: [%s] կարգավորման նիշք։ Կարդալու համար չհաջողվեց բացել կարգաբերման %s նիշքը ։ Անհանգստանալու կարիք չկա, եթե դուք գործարկել եք %s֊ն առաջին անգամ։ Օգտագործել թողարկման կարգավորումները։

source: [%s] configuration file - We reset at least one separator character as it coincides with the decimal point. If you recently changed your locales settings, this is nothing to worry about.
hy: [%s] կարգավորման նիշք - Մենք վերակայում ենք առնվազն մեկ բաժանարար նիշ, քանի որ այն համընկնում է տասնորդական կետի հետ: Եթե վերջերս փոխել եք ձեր տեղանքների կարգավորումները, ապա անհանգստանալու պատճառ չկա։

source: [%s] configuration file: strange boolean when writing. Skipping this key. %s
hy: [%s] կարգաբերման նիշք՝ տարօրինակ բուլյան է իհայտ եկել գրառման ժամանակ։ Բաց թողնելով այս կետը։ %s

source: [%s] configuration file: ignoring unknown "key_type" in "config_structure". %s
hy: [%s] կարգավորման նիշք՝ անհայտ "key_type" ֊ի անտեսում "config_structure"֊ի մեջ։ %s

source: [%s] configuration file: couldn't save/write to configuration file %s.
hy: [%s] կարգավորման նիշք՝ չկարողացավ պահել/գրառել tկարգավորման %s նիշքը։

source: [%s] Line_index exceeds valid range in function "display_delete_line". %s
hy: [%s] Line_index գերազանցում է վավեր միջակայքը "display_delete_line" ֆունկցիայում։ %s

source: [%s] unknown display option in function "display_change_option"
hy: [%s] անհայտ ցուցադրման տարբերակ "display_change_option" ֆունկցիայում

source: unsupported inverse function
hy: հակադարձ ֆունկցիան չի սպասարկվում

source: unsupported hyperbolic function
hy: հիպերբոլիկ ֆունկցիան չի սպասարկվում

source: [%s] unknown notation mode in function "all_clear". %s
hy: [%s] անհայտ նշագրման ռեժիմը "all_clear" ֆունկցիայի մեջ է։ %s

source: [%s] failed to convert char %c in function "axtof". %s
hy: [%s] չհաջողվեց փոխակերպել %c նիշը "axtof" ֆունկցիայի մեջ։ %s

source: [%s] failed to convert %s in function "ftoax". %s
hy: [%s] չհաջողվեց փոխակերպել %s ֊ը "ftoax" ֆունկցիայում։ %s

source: [%s] failed to convert color %s in function "set_button_color". %s
hy: [%s] չհաջողվեց փոխակերպել %s գույնը "set_button_color" ֆունկցիայի մեջ։ %s

source: [%s] failed to find widget %s in function "activate_menu_item". %s
hy: [%s] չհաջողվեց գտնել %s վիդջեթը "activate_menu_item" ֆունկցիայի մեջ։ %s

source: unknown number base
hy: անհայտ թվի հիմք

source: [%s] unknown number base in function "get_display_number_string". %s
hy: [%s] անհայտ թվի հիմք "get_display_number_string" ֆունկցիայում։ %s

source: [%s] unknown number base in function "get_display_number_length". %s
hy: [%s] անհայտ թվի հիմք "get_display_number_length" ֆունկցիայում։ %s

source: [%s] unknown number base in function "string2double". %s
hy: [%s] անհայտ թվի հիմք "string2double" ֆունկցիայում։ %s

source: [%s] unknown angle base in function "x2rad". %s
hy: [%s] անհայտ անկյան հիմք "x2rad" ֆունկցիայում։ %s

source: [%s] unknown angle base in function "rad2x". %s
hy: [%s] անհայտ անկյան հիմք "rad2x" ֆունկցիայում։ %s

source: [%s] unknown number base in function "get_sep". %s
hy: [%s] անհայտ թվի հիմք "get_sep" ֆունկցիայում։ %s

source: [%s] unknown number base in function "get_sep_length". %s
hy: [%s] անհայտ թվի հիմք "get_sep_length" ֆունկցիայում։ %s

source: [%s] unknown number base in function "get_sep_char". %s
hy: [%s] անհայտ թվի հիմք "get_sep_char" ֆունկցիայում։ %s

source: unknown display option in function "change_option"
hy: սնհայը ցուցադրման տարբերակ "change_option" ֆունկցիայի մեջ

source: [%s] Couldn't load %s. This file is necessary to build galculator's user interface. Make sure you did a make install and the file is accessible!
hy: [%s] Չհաջողվեց բեռնել %s֊ը։ Այս նիշքն անհրաժեշտ է galculator֊ի միջերեսը կառուցելու համար։ Համոզվեք, որ կատարել եք make install հրամանը և նիշքը հասանելի է!

source: Show _menu bar
hy: Ցուցադրել _ընտրացանկը

source: %s Preferences
hy: %s Նախընտրանքներ

source: Name
hy: Անուն

source: Value
hy: Արժեք

source: Description
hy: Նկարագրություն

source: Variable
hy: Փոփոխական

source: Expression
hy: Արտահայտություն

source: Enter
hy: Մուտքագրել

source: Power
hy: Հզորություն

source: Open Bracket
hy: Բացել փակագիծը

source: Close Bracket
hy: Փակել փակագիծը

source: swap current number with top of stack
hy: փոխանակել ընթացիկ համարը մեք քայլ դեպի վեր

source: roll
hy: գլորել

source: roll down stack
hy: գլորել դեպի ներքև

source: Result Display
hy: Արդյունքների ցուցադրում

source: [%s] flex parser was called more than %i times. Do you know what you are doing? If not: %s
hy: [%s] flex parser կանչվել է %i֊ից ավելի։ Գիտե՞ք թե ինչ եք անում։ Եթե ոչ, ապա՝ %s

source: About galculator
hy: G֊հաշվիչի մասին

source: Copyright (c) 2002-2014 by Simon Flöry <simon.floery@rechenraum.com>
hy: Հեղինակային իրավունք (c) 2002-2014 Սայմոն Ֆլորի <simon.floery@rechenraum.com>

source: a GTK+ based scientific calculator
hy: GTK+ -ի վրա հիմնված գիտական հաշվիչ

source: Seven
hy: Յոթ

source: Eight
hy: Ութ

source: Nine
hy: Ինը

source: Divide
hy: Բաժանած

source: Four
hy: Չորս

source: Five
hy: Հինգ

source: Six
hy: Վեց

source: Three
hy: Երեք

source: Subtract
hy: Հանած

source: Change sign
hy: Փոխել նշանը

source: Multiply
hy: Բազմապատկած

source: Add current display value to memory
hy: Ավելացնել ընթացիկ արժեքը հիշողության մեջ

source: Read from memory
hy: Կարդալ հիշողությունից

source: Save to memory
hy: Պահել հիշողության մեջ

source: Zero
hy: Զրո

source: Decimal point
hy: Տասնորդական կետ

source: One
hy: Մեկ

source: Two
hy: Երկու

source: sqrt
hy: Քառակուսի

source: Square root
hy: Քառակուսի արմատ

source: Percent
hy: Տոկոս

source: The main program window.
hy: Ծրագրի հիմնական պատուհանը։

source: Formula entry text field - enter string expression to compute here.
hy: Բանաձևի մուտքագրման տեքստային դաշտ։ Մուտքագրեք տողի արտահայտությունն՝ այստեղ հաշվարկելու համար։

source: Reset calculator (clear all)
hy: Վերակայել հաշվիչը (մաքրել ամենը)

source: Clear display
hy: Մաքրել էկրանը

source: _File
hy: _Նիշք

source: _Edit
hy: _Խմբագրել

source: Cu_t Display Value
hy: Կտրել էկրանի արժեքը

source: _Copy Display Value
hy: _Պատճենել էկրանի արժեքը

source: _Paste and Append to Display Value
hy: _Տեղադրել և հավելել էկրանի արժեքը

source: _Preferences...
hy: _Նախընտրանքներ...

source: _View
hy: _Տեսք

source: _Basic Mode
hy: _Սովորական ռեժիմ

source: _Scientific Mode
hy: _Գիտական ռեժիմ

source: _Paper Mode
hy: _Թղթային ռեժիմ

source: Buttons
hy: Կոճակներ

source: Display Control
hy: Ցուցադրել կառավարումը

source: Functions
hy: Ֆունկցիաներ

source: Logical
hy: Տրամաբանական

source: Standard
hy: Ստանդարտ

source: _Calculator
hy: _Հաշվիչ

source: _Number bases
hy: _Թվերի հիմքերը

source: _Decimal
hy: _Տասնորդական

source: _Hexadecimal
hy: _Տասնվեցական

source: _Octal
hy: Ութական

source: _Binary
hy: _Երկուական

source: Angle _units
hy: Անկյան _միավորներ

source: D_egrees
hy: Աստիճաններ

source: _Radians
hy: _Ռադիաններ

source: _Gradians
hy: _Գրադիաններ

source: Notation _modes
hy: Նշումային _ռեժիմները

source: _Algebraic
hy: _Հանրահաշվական

source: _Reverse Polish (RPN)
hy: _Հակադարձ լեհական (RPN)

source: _Formula Entry
hy: _Բանաձևի մուտք

source: _Quit
hy: _Փակել

source: _Paste As Display Value
hy: _Տեղադրել որպես էկրանի արժեք

source: _About...
hy: _Մեր Մասին...

source: galculator - Preferences
hy: galculator - Նախընտրանքներ

source: A dialog that is used to change preferences settings.
hy: Երկխոսություն, որի օգնությամբ կարող եք փոխել նախընտրած կարգավորումները.

source: Closes the dialog.
hy: Փակել երկխոսության պատուհանը

source: <b>Appearance</b>
hy: <b>Արտաքին տեսքը</b>

source: Result font:
hy: Տառատեսակի արդյունքը՝

source: Inactive module color:
hy: Ոչ ակտիվ մոդուլի գույնը՝:

source: Active module color:
hy: Ակտիվ մոդուլի գույնը՝

source: Result font color:
hy: Տառատեսակի գույնի արդյունքը՝

source: Background color:
hy: Ֆոնի գույնը

source: Module font:
hy: Մոդուլի տառատեսակը՝

source: RPN stack font:
hy: RPN փաթեթի տառատեսակը՝

source: RPN stack color:
hy: RPN փաթեթի գույնը՝

source: Pick a Display Background Color
hy: Ընտրեք էկրանի ֆոնի գույնը

source: Pick a Display Result Font Color
hy: Ընտրեք էկրանին տեքստի տառատեսակի գույնը

source: Pick a RPN Stack Color
hy: Ընտրեք RPN փաթեթի գույնը

source: Pick a Inactive Module Color
hy: Ընտրեք ոչ ակտիվ մոդուլի գույնը

source: Pick a Active Module Color
hy: Ընտրեք ակտիվ մոդուլի գույնը

source: Pick a Result Font
hy: Ընտրեք արդյունքի տառատեսակը

source: Pick a RPN Stack Font
hy: Ընտրեք RPN փաթեթի տառատեսակը

source: Pick a Module Font
hy: Ընտրեք մոդուլի տառատեսակը

source: <b>Modules Visibility</b>
hy: <b>Մոդուլների տեսանելիություն</b>

source: Angle base units
hy: Անկյան հիմնական միավորները

source: Notation
hy: Նշում

source: Arithmetic operation
hy: Թվաբանական գործողություն

source: Open brackets
hy: Բացել փակագծերը

source: Number base units
hy: Թվի հիմնական միավորները

source: Display
hy: Էկրան

source: <b>Font</b>
hy: <b>Տառատեսակ</b>

source: Use custom button font
hy: Օգտագործել հատուկ տառատեսակ կոճակի համար

source: Button font:
hy: Կոճակի տառատեսակը՝

source: Pick a Button Font
hy: Ընտրեք կոճակի տառատեսակը՝

source: <b>Dimension</b>
hy: <b>Չափս</b>

source: Minimal button width:
hy: Կոճակի նվազագույն հաստություն՝

source: Minimal button height:
hy: Կոճակի նվազաֆույն բարձրություն

source: <b>User defined constants:</b>
hy: <b>Օգտագործողի կողմից սահմանված հաստատուններ՝</b>

source: Name:
hy: Անուն՝

source: Value:
hy: Արժեք՝

source: Description:
hy: Նկարագրություն՝

source: Add
hy: Ավելացնել

source: Update
hy: Թարմացնել

source: Clear
hy: Մաքրել

source: <b>User defined functions:</b>
hy: <b>Օգտագործողի կողմից սահմանված ֆունկցիաներ՝</b>

source: Variable:
hy: Փոփոխականներ՝

source: Expression:
hy: Արտահայտություն՝

source: Configure number base:
hy: Կարգացորել թվի հիմքը՝

source: <b>Decimal Settings</b>
hy: <b>Տասնորդականի կարգավորումներ</b>

source: Show thousands separator
hy: Ցուցադրել բաժանիչը հազարերոդականներով

source: Separator character:
hy: Բաժանիչի նիշը՝

source: Separator block length:
hy: Բաժանիչի մասնիկի երկարությունը

source: <b>Hexadecimal Settings</b>
hy: <b>Տասնվեցականի կարգավորումներ</b>

source: Signed
hy: Նշանակված

source: Show separator
hy: Ցույց տալ բաժանիչը

source: Number of bits:
hy: Բիթերի քանակը՝

source: <b>Octal Settings</b>
hy: <b>Ութականի կարգավորումներ</b>

source: <b>Binary Settings</b>
hy: <b>Երկուականի կարգավորումներ</b>

source: Fix length to a multiple of
hy: Ամրագրել երկարությունը բազմապատիկին

source: Numbers
hy: Թվեր

source: finite stack size (x, y, z, t)
hy: Վերջավոր արժեքի չափսը (x, y, z, t)

source: infinite stack size
hy: անվերջ արժեքի չափսը

source: <b>Startup</b>
hy: <b>Մեկնարկ</b>

source: Remember display value on exit
hy: Հիշել էկրանի արժեքը ելքում

source: <b>Visibility</b>
hy: <b>Տեսանելիություն</b>

source: Show menu bar
hy: Ցուցադրել ընտրացանկը

source: Natural logarithm (base: e)
hy: Բնական լոգարիթմ (base: e)

source: Factorial
hy: Ֆակտորիալ

source: Enter exponent (base: 10)
hy: Էքսպոնենտի մուտք (base: 10)

source: Logarithm (base: 10)
hy: Լոգարիթմ (base: 10)

source: Square
hy: Քառակուսի

source: User defined functions
hy: Օգտագործողի կողմից սահմանված ֆունկցիաներ

source: Inverse mode
hy: Հակադարձ ռեժիմ

source: Hyperbolic mode
hy: Հիպերբոլիկ ռեժիմ

source: Logical AND
hy: Տրամաբանական և

source: Logical OR
hy: Տրամաբանական կամ

source: Logical XOR
hy: Տրամաբանական բացառիկ OR

source: Bitwise complement
hy: Զույգ երկուականի լրացում

source: Hexadecimal 0xC
hy: Տասնվեցական 0xC

source: Hexadecimal 0xD
hy: Տասնվեցական 0xD

source: Hexadecimal 0xF
hy: Տասնվեցական 0xF

source: Hexadecimal 0xB
hy: Տասնվեցական 0xB

source: Hexadecimal 0xA
hy: Տասնվեցական 0xA

source: Modulus
hy: Մոդուլներ

source: Left shift
hy: Ձախ փոխարկում
