Repository: GNOME/gnome-calculator
Catalog: po/*.po
Languages: hy, uz

source: Calculator
uz: Kalkulyator

source: Perform arithmetic, scientific or financial calculations
uz: Arifmetik, ilmiy yoki moliyaviy hisob-kitoblarni bajaring

source: calculation;arithmetic;scientific;financial;
uz: hisob;arifmetik;ilmiy;moliyaviy;

source: Calculator is an application that solves mathematical equations. Though it at first appears to be a simple calculator with only basic arithmetic operations, you can switch into Advanced, Financial, or Programming mode to find a surprising set of capabilities.
uz: Kalkulyator — bu matematik tenglamalarni yechuvchi dastur. Avvaliga u faqat oddiy arifmetik amallarni bajara oladigan oddiy kalkulyatorga oʻxshaydi ammo siz uni Kengaytirilgan, Moliyaviy yoki Dasturlash rejimiga oʻtkazib kutilmagan imkoniyatlar toʻplamini topishingiz mumkin.

source: The Advanced calculator supports many operations, including: logarithms, factorials, trigonometric and hyperbolic functions, modulus division, complex numbers, random number generation and prime factorization.
uz: Kengaytirilgan kalkulyator koʻplab amallarni qoʻllab-quvvatlaydi, jumladan: logarifmlar, faktoriallar, trigonometrik va giperbolik funksiyalar, modul boʻyicha boʻlish, kompleks sonlar, tasodifiy sonlar generatsiyasi va tub koʻpaytuvchilarga ajratish.

source: Financial mode supports several computations, including periodic interest rate, present and future value, double declining and straight line depreciation, and many others.
uz: Moliyaviy rejim bir nechta hisob-kitoblarni qoʻllab-quvvatlaydi, jumladan: davriy foiz stavkalari, joriy va kelajak qiymatlari, tezlashtirilgan va chiziqli amortizatsiya hamda boshqa koʻplab amallar.

source: Programming mode supports calculations using common bases (binary, octal, decimal, and hexadecimal), bitwise operations, ones’ and two’s complement, character to character code conversion, and more.
uz: Dasturlash rejimi odatiy sanoq tizimlarida (ikkilik, sakkizlik, oʻnlik va oʻn oltilik hisoblashni), bitlar boʻyicha amallarni, birinchi va ikkinchi toʻldiruvlarni, belgilar kodlarini oʻzaro oʻgirishni va boshqalarni qoʻllab-quvvatlaydi.

source: Conversion mode supports conversions between common units, currencies and number bases.
uz: Aylantirish rejimi turli birliklar, valyutalar va sonlar asoslari oʻrtasidagi konvertatsiyalarni qoʻllab-quvvatlaydi.

source: Basic Mode
uz: Oddiy rejim

source: Advanced Mode
uz: Kengaytirilgan rejim

source: Financial Mode
uz: Moliyaviy rejim

source: Programming Mode
uz: Dasturlash rejimi

source: Keyboard Mode
uz: Klaviatura rejimi

source: Conversion Mode
uz: Aylantirish rejimi

source: The GNOME Project
uz: GNOME loyihasi

source: Accuracy value
uz: Aniqlik qiymati

source: The number of digits displayed after the numeric point
uz: Kasrdan keyin koʻrsatiladigan raqamlar soni

source: Word size
uz: Soʻz hajmi

source: The size of the words used in bitwise operations
uz: Bitlar boʻyicha amallarda ishlatiladigan soʻzlarning hajmi

source: Numeric Base
uz: Sanoq tizimi

source: The numeric base
uz: Sanoq tizimining turi

source: Show Thousands Separators
uz: Minglik ajratkichlarini koʻrsatish

source: Indicates whether thousands separators are shown in large numbers.
uz: Katta sonlarda minglik ajratkichlari koʻrsatilishini bildiradi.

source: Show Trailing Zeroes
uz: Oxirgi nol raqamlarini koʻrsatish

source: Indicates whether any trailing zeroes after the numeric point should be shown in the display value.
uz: Kasrdan keyin keluvchi nol raqamlar ekranda koʻrsatilishini bildiradi.

source: Number format
uz: Son formati

source: The format to display numbers in
uz: Sonlarni koʻrsatish uchun ishlatiladigan format

source: Angle units
uz: Burchak birliklari

source: The angle units to use
uz: Ishlatiladigan burchak birliklari

source: Currency update interval
uz: Valyuta yangilanish oraligʻi

source: How often the currency exchange rates should be updated. A value of 0 means the currency exchange rates won't be fetched from the network at all.
uz: Valyuta kurslari qanchalik tez-tez yangilanishini belgilaydi. 0 qiymati kurslar umuman tarmoqdan olinmasligini bildiradi.

source: Currency display
uz: Valyuta koʻrinishi

source: Indicates whether to show currency code, currency name or both of them in the converter.
uz: Konvertorda valyuta kodi, nomi yoki ikkisi ham koʻrsatilishini bildiradi.

source: Enabled completions
uz: Faol avtomatik takliflar

source: The types of completion proposals to be shown in the auto-completion list.
uz: Avtomatik toʻldirish roʻyxatida koʻrsatiladigan taklif turlari.

source: Favorite currencies
uz: Sevimli valyutalar

source: The favorite currencies to be shown at the top of the currency list.
uz: Valyutalar roʻyxatining yuqori qismida koʻrsatiladigan sevimli valyutalar.

source: Button mode
uz: Tugma rejimi

source: The button mode
uz: Tugma rejimi

source: Unit category
uz: Birlik toifasi

source: Currently selected unit category in the converter
uz: Konvertorda hozirda tanlangan birlik toifasi

source: Source units
uz: Manba birliklari

source: Currently selected source units in the converter
uz: Konvertorda hozirda tanlangan manba birliklari

source: Target units
uz: Maqsad birliklari

source: Currently selected target units in the converter
uz: Konvertorda hozirda tanlangan maqsad birliklari

source: Internal precision
uz: Ichki aniqlik

source: The internal precision used with the MPFR library
uz: MPFR kutubxonasi bilan ishlatiladigan ichki aniqlik

source: Window position
uz: Oyna pozitsiyasi

source: Window position (x and y) of the last closed window.
uz: Oxirgi yopilgan oynaning joylashuvi (x va y).

source: Window maximized
uz: Oyna maksimallashtirildi

source: Whether the last closed window was maximized.
uz: Oxirgi yopilgan oyna maksimallashtirilganligini bildiradi.

source: Window size
uz: Oyna oʻlchami

source: Window size (width and height) of the last closed window.
uz: Oxirgi yopilgan oynaning oʻlchami (eni va boʻyi).

source: UAE Dirham
uz: BAA Dirhami

source: Argentine Peso
uz: Argentina Pesosi

source: Australian Dollar
uz: Avstraliya Dollari

source: Bangladeshi Taka
uz: Bangladesh Takasi

source: Bulgarian Lev
uz: Bolgariya Levi

source: Bahraini Dinar
uz: Bahrayn Dinori

source: Brunei Dollar
uz: Bruney Dollari

source: Brazilian Real
uz: Braziliya Reali

source: Botswana Pula
uz: Botsvana Pulasi

source: Canadian Dollar
uz: Kanada Dollari

source: CFA Franc
uz: CFA Franki

source: Swiss Franc
uz: Shveytsariya Franki

source: Chilean Peso
uz: Chili Pesosi

source: Chinese Yuan
uz: Xitoy Yuani

source: Colombian Peso
uz: Kolumbiya Pesosi

source: Czech Koruna
uz: Chex Korunasi

source: Danish Krone
uz: Daniya Kronasi

source: Algerian Dinar
uz: Jazoir Dinori

source: Estonian Kroon
uz: Estoniya Krooni

source: Egyptian Pound
uz: Misr Funti

source: Euro
uz: Yevro

source: British Pound Sterling
uz: Angliya Funt Sterlingi

source: Hong Kong Dollar
uz: Gonkong Dollari

source: Croatian Kuna
uz: Xorvatiya Kunasi

source: Hungarian Forint
uz: Vengriya Forinti

source: Indonesian Rupiah
uz: Indoneziya Rupiyasi

source: Israeli New Shekel
uz: Isroil Yangi Shekeli

source: Indian Rupee
uz: Hind Rupiyasi

source: Iranian Rial
uz: Eron Riali

source: Icelandic Krona
uz: Islandiya Kronasi

source: Japanese Yen
uz: Yaponiya Yenasi

source: Jamaican Dollar
uz: Yamayka Dollari

source: South Korean Won
uz: Janubiy Koreya Voni

source: Kuwaiti Dinar
uz: Quvayt Dinori

source: Kazakhstani Tenge
uz: Qozogʻiston Tengesi

source: Sri Lankan Rupee
uz: Shri-Lanka Rupiyasi

source: Libyan Dinar
uz: Liviya Dinori

source: Mauritian Rupee
uz: Mavrikiy Rupiyasi

source: Mexican Peso
uz: Meksika Pesosi

source: Malaysian Ringgit
uz: Malayziya Ringgiti

source: Nigerian Naira
uz: Nigeriya Nairasi

source: Norwegian Krone
uz: Norvegiya Kronasi

source: Nepalese Rupee
uz: Nepal Rupiyasi

source: New Zealand Dollar
uz: Yangi Zelandiya Dollari

source: Omani Rial
uz: Ummon Riali

source: Peruvian Nuevo Sol
uz: Peru Soli

source: Philippine Peso
uz: Filippin Pesosi

source: Pakistani Rupee
uz: Pokiston Rupiyasi

source: Polish Złoty
uz: Polsha Zlotisi

source: Qatari Riyal
uz: Qatar Riyali

source: New Romanian Leu
uz: Ruminiya Leusi

source: Russian Ruble
uz: Rossiya Rubli

source: Saudi Riyal
uz: Saudiya Riyali

source: Serbian Dinar
uz: Serbiya Dinori

source: Swedish Krona
uz: Shvetsiya Kronasi

source: Singapore Dollar
uz: Singapur Dollari

source: Thai Baht
uz: Tailand Bahti

source: Tunisian Dinar
uz: Tunis Dinori

source: Turkish Lira
uz: Turkiya Lirasi

source: T&T Dollar
uz: Trinidad va Tobago Dollari

source: New Taiwan Dollar
uz: Yangi Tayvan Dollari

source: Ukrainian Hryvnia
uz: Ukraina Grivnasi

source: US Dollar
uz: AQSh Dollari

source: Uruguayan Peso
uz: Urugvay Pesosi

source: Vietnamese Dong
uz: Vyetnam Dongi

source: South African Rand
uz: Janubiy Afrika Randi

source: Missing digits after minus sign
uz: Minus belgisidan keyin raqamlar yetishmayapti

source: Missing second symbol (″)
uz: Ikkinchi belgisi (″) yetishmayapti

source: Missing minute symbol (′)
uz: Daqiqa belgisi (′) yetishmayapti

source: Missing digits after decimal point
uz: Oʻnlik nuqtadan keyin raqamlar yetishmayapti

source: in
uz: ichida

source: to
uz: ga

source: Function “%s” is missing arguments
uz: “%s” funksiyasida argumentlar yetishmayapti

source: The zeroth root of a number is undefined
uz: Sonning nol darajali ildizi aniqlanmagan

source: Mathematics
uz: Matematika

source: Euler’s Number
uz: Eyler soni

source: Golden Ratio
uz: Oltin nisbat

source: Electromagnetism
uz: Elektromagnetizm

source: Light Speed
uz: Yorugʻlik tezligi

source: Elementary Charge
uz: Elementar zaryad

source: Impedance of Vacuum
uz: Vakuumning qarshiligi

source: Permeability of Vacuum
uz: Vakuumning magnit oʻtkazuvchanligi

source: Permittivity of Vacuum
uz: Vakuumning dielektrik oʻtkazuvchanligi

source: Atomic & Nuclear
uz: Atom va yadro

source: Planck’s Constant
uz: Plank doimiysi

source: Fine-Structure Constant
uz: Juda nozik tuzilish doimiysi

source: Electron Mass
uz: Elektron massasi

source: Proton Mass
uz: Proton massasi

source: Thermodynamics
uz: Termodinamika

source: Boltzmann Constant
uz: Boltsman doimiysi

source: Atomic Mass Unit
uz: Atom massasi birligi

source: Molar Gas Constant
uz: Molyar gaz doimiysi

source: Stefan-Boltzmann Constant
uz: Stefan–Boltsman doimiysi

source: Avogadro’s Number
uz: Avogadro soni

source: Gravitation
uz: Gravitatsiya

source: Gravitational Constant
uz: Gravitatsion doimiy

source: Earth Acceleration
uz: Yer tortishish tezlanishi

source: Error: the number of periods must be positive
uz: Xato: davrlar soni musbat boʻlishi kerak

source: Trigonometry
uz: Trigonometriya

source: Sine
hy: Սինուս
uz: Sinus

source: Cosine
hy: Կոսինուս
uz: Kosinus

source: Tangent
hy: Տանգենս
uz: Tangens

source: Inverse Sine
uz: Arksinus

source: Inverse Cosine
uz: Arkkosinus

source: Inverse Tangent
uz: Arktangens

source: Hyperbolic Sine
uz: Giperbolik sinus

source: Hyperbolic Cosine
uz: Giperbolik kosinus

source: Hyperbolic Tangent
uz: Giperbolik tangens

source: Inverse Hyperbolic Sine
uz: Giperbolik arksinus

source: Inverse Hyperbolic Cosine
uz: Giperbolik arkkosinus

source: Inverse Hyperbolic Tangent
uz: Giperbolik arktangens

source: Complex
uz: Murakkab sonlar

source: Complex Conjugate
uz: Murakkab qoʻshma son

source: Complex Argument
uz: Murakkab argument

source: Real Component
uz: Haqiqiy qism

source: Imaginary Component
uz: Yalpi qism (imaginariya)

source: Programming
uz: Dasturlash

source: Ones’ Complement
uz: Birlik qoʻshimchasi

source: Two’s Complement
uz: Ikkinchi qoʻshimcha

source: Swap Endianness
uz: Bayt tartibini almashtirish

source: Modulus Divide
uz: Modulyar boʻlish

source: Modular Exponentiation
uz: Modulyar darajaga koʻtarish

source: Rounding
uz: Yaxlitlash

source: Round
uz: Yaxlitlash

source: Floor
uz: Pastga yaxlitlash

source: Ceiling
uz: Yuqoriga yaxlitlash

source: Integer Component
uz: Butun qism

source: Fractional Component
uz: Kasr qism

source: Statistics
uz: Statistika

source: Sum
hy: Գումարած
uz: Yigʻindi

source: Sum of Squares
uz: Kvadratlar yigʻindisi

source: Average
uz: Oʻrtacha

source: Minimum Value
uz: Minimal qiymat

source: Maximum Value
uz: Maksimal qiymat

source: Sample Standard Deviation
uz: Tanlanma standart ogʻish

source: Population Standard Deviation
uz: Populyatsiya standart ogʻishi

source: Sample Variance
uz: Tanlanma dispersiya

source: Population Variance
uz: Populyatsiya dispersiyasi

source: Sundry
uz: Har xil

source: Logarithm
uz: Logarifm

source: Natural Logarithm
uz: Natural logarifm

source: Square Root
uz: Kvadrat ildiz

source: Absolute Value
uz: Mutlaq qiymat

source: Signum
uz: Belgi funksiyasi

source: Combination
uz: Kombinatsiya

source: Permutation
uz: Permutatsiya

source: Greatest Common Divisor
uz: Eng katta umumiy boʻluvchi

source: Least Common Multiple
uz: Eng kichik umumiy karrali

source: Comparison (Kronecker Delta)
uz: Taqqoslash (Kroneker deltas)

source: Function “%s” takes 1 argument
uz: "%s" funksiyasi 1 ta argument qabul qiladi

source: Function “%s” takes 1 or 2 arguments
uz: "%s" funksiyasi 1 yoki 2 ta argument qabul qiladi

source: Function “%s” takes at least 2 arguments
uz: "%s" funksiyasi kamida 2 ta argumentni qabul qiladi

source: Function “%s” takes %d argument
uz: "%s" funksiyasi %d ta argument oladi

source: No undo history
uz: Bekor qilish tarixi yoʻq

source: No redo history
uz: Qayta tiklash tarixi yoʻq

source: No sane value to store
uz: Saqlash uchun yaroqli qiymat yoʻq

source: Unknown variable “%s”
uz: Noma’lum oʻzgaruvchi “%s

source: Exchange rate for “%s” is not available
uz: “%s” uchun valyuta kursi mavjud emas

source: Unknown unit “%s”
uz: Noma’lum birlik “%s”

source: Function “%s” is not defined
uz: “%s” funksiyasi aniqlanmagan

source: Unknown conversion
uz: Noma’lum konversiya

source: Malformed expression
uz: Notoʻgʻri ifoda

source: Calculating
uz: Hisoblanmoqda

source: Need an integer to factorize
uz: Faktorlashtirish uchun butun son kerak

source: Underflow error
uz: Past toʻldirish xatosi

source: Overflow error
uz: Toʻlib ketish xatosi

source: Argument not defined for zero
uz: Nol uchun argument aniqlanmagan

source: Floor is only defined for real numbers
uz: Pastga yaxlitlash faqat haqiqiy sonlar uchun aniqlangan

source: Ceiling is only defined for real numbers
uz: Yuqoriga yaxlitlash faqat haqiqiy sonlar uchun aniqlangan

source: Round is only defined for real numbers
uz: Yaxlitlash faqat haqiqiy sonlar uchun aniqlangan

source: The power of zero is undefined for a negative exponent
uz: Manfiy daraja uchun nolning darajasi aniqlanmagan

source: Zero raised to zero is undefined
uz: Nolning nol darajasi aniqlanmagan

source: Logarithm of zero is undefined
uz: Nolning logarifmi aniqlanmagan

source: Logarithm with base 0 or 1 is undefined
uz: Asosi 0 yoki 1 boʻlgan logarifm aniqlanmagan

source: Factorial is only defined for non-negative real numbers
uz: Faktorial faqat manfiy boʻlmagan haqiqiy sonlar uchun aniqlangan

source: Division by zero is undefined
uz: Nolga boʻlish aniqlanmagan

source: Modulus division is only defined for integers
uz: Modulyar boʻlish faqat butun sonlar uchun aniqlangan

source: Tangent is undefined for angles that are multiples of π (180°) from π∕2 (90°)
uz: Tangens π/2 (90°) dan π (180°) ning koʻpaytmalari boʻlgan burchaklar uchun aniqlanmagan

source: Inverse sine is undefined for values outside [-1, 1]
uz: Arksinus [-1, 1] oraliqdan tashqaridagi qiymatlar uchun aniqlanmagan

source: Inverse cosine is undefined for values outside [-1, 1]
uz: Arkkosinus [-1, 1] oraliqdan tashqaridagi qiymatlar uchun aniqlanmagan

source: Inverse tangent is undefined for values i and -i
uz: Arktangens qiymatlar i va -i uchun aniqlanmagan

source: Inverse hyperbolic cosine is undefined for values less than one
uz: Giperbolik arkkosinus 1 dan kichik qiymatlar uchun aniqlanmagan

source: Inverse hyperbolic tangent is undefined for values outside [-1, 1]
uz: Giperbolik arktangens [-1, 1] oraliqdan tashqaridagi qiymatlar uchun aniqlanmagan

source: Boolean AND is only defined for non-negative integers
uz: Mantiqiy AND faqat manfiy boʻlmagan butun sonlar uchun aniqlangan

source: Boolean NAND is only defined for non-negative integers
uz: Mantiqiy NAND faqat manfiy boʻlmagan butun sonlar uchun aniqlangan

source: Boolean OR is only defined for non-negative integers
uz: Mantiqiy OR faqat manfiy boʻlmagan butun sonlar uchun aniqlangan

source: Boolean NOR is only defined for non-negative integers
uz: Mantiqiy NOR faqat manfiy boʻlmagan butun sonlar uchun aniqlangan

source: Boolean XOR is only defined for non-negative integers
uz: Mantiqiy XOR faqat manfiy boʻlmagan butun sonlar uchun aniqlangan

source: Boolean XNOR is only defined for non-negative integers
uz: Mantiqiy XNOR faqat manfiy boʻlmagan butun sonlar uchun aniqlangan

source: Boolean NOT is only defined for non-negative integers
uz: Mantiqiy NOT faqat manfiy boʻlmagan butun sonlar uchun aniqlangan

source: Shift is only possible on integers
uz: Siljitish faqat butun sonlarda amalga oshiriladi

source: Overflow. Try a bigger word size
uz: Toʻlib ketish. Kattaroq soʻz hajmini sinab koʻring

source: Ones’ complement is only defined for non-negative integers
uz: Birlar toʻldiruvchisi faqat manfiy boʻlmagan butun sonlar uchun aniqlangan

source: Two’s complement is only defined for non-negative integers
uz: Ikkilik toʻldiruvchisi faqat manfiy boʻlmagan butun sonlar uchun aniqlangan

source: Swap endianness is only possible on integers
uz: Bayt tartibini almashtirish faqat butun sonlarda mumkin

source: Combination is only defined for non-negative integers
uz: Kombinatsiya faqat manfiy boʻlmagan butun sonlar uchun aniqlangan

source: Combination is undefined if n is less than r
uz: Agar n r dan kichik boʻlsa, kombinatsiya aniqlanmagan

source: Permutation is only defined for non-negative integers
uz: Permutatsiya faqat manfiy boʻlmagan butun sonlar uchun aniqlangan

source: Permutation is undefined if n is less than r
uz: Agar n r dan kichik boʻlsa, permutatsiya aniqlanmagan

source: Greatest common divisor is only defined for integers
uz: Eng katta umumiy boʻluvchi faqat butun sonlar uchun aniqlangan

source: Least common multiple is only defined for integers
uz: Eng kichik umumiy koʻpaytuvchi faqat butun sonlar uchun aniqlangan

source: Median is only defined for real numbers
uz: Median faqat haqiqiy sonlar uchun aniqlangan

source: Minimum value is only defined for real numbers
uz: Minimal qiymat faqat haqiqiy sonlar uchun aniqlangan

source: Maximum value is only defined for real numbers
uz: Maksimal qiymat faqat haqiqiy sonlar uchun aniqlangan

source: Bank of Canada
uz: Kanada banki

source: European Central Bank
uz: Yevropa markaziy banki

source: International Monetary Fund
uz: Xalqaro valyuta jamgʻarmasi

source: United Nations Treasury
uz: Birlashgan Millatlar Tashkiloti gʻaznachiligi

source: The result is too long to display in fixed format. Try other result formats
uz: Natija qat’iy formatda koʻrsatish uchun juda uzun. Boshqa formatni sinab koʻring

source: Angle
uz: Burchak

source: Length
uz: Uzunlik

source: Area
uz: Yuza

source: Volume
uz: Tovush

source: Mass
uz: Ogʻirlik

source: Speed
uz: Tezlik

source: Duration
uz: Davomiyligi

source: Frequency
uz: Chastota

source: Temperature
uz: Harorat birligi

source: Energy
uz: Energiya

source: Pressure
uz: Bosim

source: Digital Storage
uz: Raqamli xotira

source: Degrees (Decimal)
uz: Daraja (Oʻnlik)

# unit-symbols
source: degree,degrees,deg
uz: daraja,darajalar,deg

source: Degrees (D°M′S″)
uz: Daraja (D°M′S″)

source: Radians
uz: Radianlar

# unit-symbols
source: radian,radians,rad
uz: radian,radianlar,rad

source: Gradians
uz: Graduslar

# unit-symbols
source: gradian,gradians,grad
uz: gradian,graduslar,grad

source: Parsecs
uz: Parallaks soni (Parsek)

# unit-symbols
source: parsec,parsecs,pc
uz: parsek,parseklar,pc

source: Light Years
uz: Yorugʻlik yillari

# unit-symbols
source: lightyear,lightyears,ly
uz: yoruglik yili,yoruglik yillari,ly

source: Astronomical Units
uz: Astronomik birliklar

# unit-symbols
source: au
uz: ab

source: Rack Units
uz: Rak birliklar

source: Nautical Miles
uz: Dengiz millari

source: Miles
uz: Millar

# unit-symbols
source: mile,miles,mi
uz: mil,millar,mi

source: Kilometers
uz: Kilometrlar

# unit-symbols
source: kilometer,kilometers,km,kms
uz: kilometr,kilometrlar,km

source: Cables
uz: Kabel uzunligi

# unit-symbols
source: cable,cables,cb
uz: kabel,kabellar,cb

source: Fathoms
uz: Fatomlar

# unit-symbols
source: fathom,fathoms,ftm
uz: fatom,fatomlar,ftm

source: Meters
uz: Metr

# unit-symbols
source: meter,meters,m
uz: metr,metrlari,m

source: Yards
uz: Yardlar

# unit-symbols
source: yard,yards,yd
uz: yard,yardlar,yd

source: Feet
uz: Futlar

# unit-symbols
source: foot,feet,ft
uz: fut,futlar,ft

source: Inches
uz: Dyuym

# unit-symbols
source: inch,inches,in
uz: dyuym,dyuym,inch

source: Centimeters
uz: Santimetrlar

# unit-symbols
source: centimeter,centimeters,cm,cms
uz: santimetr,santimetrlar,cm

source: Millimeters
uz: Millimetrlar

# unit-symbols
source: millimeter,millimeters,mm
uz: millimetr,millimetrlar,mm

source: Micrometers
uz: Mikrometrlar

# unit-symbols
source: micrometer,micrometers,um
uz: mikrometr,mikrometrlar,um

source: Nanometers
uz: Nanometrlar

# unit-symbols
source: nanometer,nanometers,nm
uz: nanometr,nanometrlar,nm

source: Desktop Publishing Points
uz: Nashr nuqtalari

# unit-symbols
source: point,pt,points,pts
uz: nuqta,pt,nuqtalar,pts

source: Kilometers per Hour
uz: Soatiga kilometr

# unit-symbols
source: kilometers per hour,kmph,kmh,kph
uz: km/soat,kmh,kph

source: Miles per Hour
uz: Soatiga mil

# unit-symbols
source: milesph,miles per hour,mi/h,miph,mph
uz: mil/soat,mph

source: Meters per Second
uz: Sekundiga metr

# unit-symbols
source: meters per second,mps
uz: m/s,mps

source: Feet per Second
uz: Sekundiga fut

# unit-symbols
source: fps,feet per second,feetps
uz: fut/s,fps

source: Knots
uz: Tugunlar

# unit-symbols
source: kt,kn,nd,knot,knots
uz: tugun,kt,kn

source: Hectares
uz: Gektarlar

# unit-symbols
source: hectare,hectares,ha
uz: gektar,gektarlar,ha

source: Acres
uz: Akrlar

# unit-symbols
source: acre,acres
uz: akr,akrlar

source: Square Miles
uz: Kvadrat millar

source: Square Feet
uz: Kvadrat fut

source: Square Kilometers
uz: Kvadrat kilometr

source: Square Meters
uz: Kvadrat metr

source: Square Centimeters
uz: Kvadrat santimetr

source: Square Millimeters
uz: Kvadrat millimetr

source: Cubic Meters
uz: Kub metr

source: British Gallons
uz: Britaniya gallonlari

source: US Gallons
uz: AQSH gallonlari

source: Liters
uz: Litr

source: US Quarts
uz: AQSH choraklari

source: British Pints
uz: Britaniya pinti

source: US Pints
uz: AQSH pintlari

source: Metric Cups
uz: Metrik kuboklar

source: Milliliters
uz: Millilitr

source: Microliters
uz: Mikrolitrlar

source: Tonnes
uz: Tonnalar

# unit-symbols
source: tonne,tonnes
uz: tonna, tonnalar

source: Kilograms
uz: Kilogramm

source: Pounds
uz: Funtlar

source: Ounces
uz: Oqsillar

source: Troy Ounces
uz: Troya qirolichalari

source: Grams
uz: Grammlar

source: Milligrams
uz: Milligramm

# unit-symbols
source: milligram,milligrams,milligramme,milligrammes,mg
uz: milligramm, milligrammlar, milligrammlar, milligrammlar, mg

source: Micrograms
uz: Mikrogrammalar

# unit-symbols
source: microgram,micrograms,microgramme,microgrammes,μg,ug
uz: mikrogramm,mikrogramm,mikrogramm,mikrogramm,μg,ug

source: Stone
uz: Tosh

# unit-symbols
source: stone,st,stones
uz: tosh,tosh,toshlar

source: Centuries
uz: Asrlar

source: Decades
uz: Oʻn yilliklar

# unit-symbols
source: decade,decades
uz: oʻn yilliklar

source: Years
uz: Yillar

# unit-symbols
source: year,years
uz: yil,yillar

source: Months
uz: Oylar

# unit-symbols
source: month,months
uz: oy,oylar
